<?php

class KangxinAPI {
    private static $instance;
    private $endpoint;
    private $totalExpected = 0;
    private $timeout = 30;
    /** @var int */
    private $delay;
    private $lastRequestTime = 0;

    private function __construct($endpoint, $timeout = null) {
        $this->endpoint = trim($endpoint, '/') . '/';
        if (is_numeric($timeout) && intval($timeout) > 0) {
            $this->timeout = intval($timeout);
        }
    }

    static public function getInstance() {
        if (!self::$instance) {
            self::$instance = new KangxinAPI($GLOBALS['KANGXIN_API_URL'], $GLOBALS['KANGXIN_API_TIMEOUT']);
        }
        return self::$instance;
    }

    public function setDelay($seconds) {
        $this->delay = $seconds;
    }

    /**
     * Invokes the Kangxin API to retrieve a list of patients that should be imported in the Linkcare platform
     *
     * @param stdClass $obj
     * @throws ServiceException
     * @return KangxinPatientInfo[]
     */
    public function requestPatientList($pageSize, $pageNum) {
        $waitTime = $this->delay - (microtime(true) - $this->lastRequestTime);
        if ($waitTime > 0) {
            usleep($waitTime * 1000000);
        }

        if ($GLOBALS['SIMULATE_KANGXIN_API']) {
            $resp = $this->simulatedData($pageSize, $pageNum);
        } else {
            $params['pageSize'] = $pageSize;
            $params['pageNum'] = $pageNum;
            $resp = $this->invokeAPI('healthData/opernInfos', $params);
        }

        $this->lastRequestTime = microtime(true);

        if (!is_array($resp)) {
            throw new ServiceException(ErrorCodes::API_INVALID_DATA_FORMAT, 'healthData/opernInfos function should return an array as response');
        }

        $patients = [];
        foreach ($resp as $info) {
            $this->totalExpected = intval($info->total);
            $patients[] = KangxinPatientInfo::fromJson($info);
        }

        return $patients;
    }

    /**
     * Return the total number of expected records
     *
     * @return number
     */
    public function countTotalExpected() {
        if (!$this->totalExpected) {
            /*
             * Invoke the API to get the total number of records expected.
             * This value is refreshed each time the API is invoked
             */
            $this->requestPatientList(1, 1);
        }
        return $this->totalExpected;
    }

    /**
     * Invokes a REST function in the Kangxin API
     *
     * @param string $function
     * @param string[] $params
     * @throws ServiceException
     * @return stdClass
     */
    private function invokeAPI($function, $params, $sendAsJson = true) {
        $this->httpStatus = null;

        $endpoint = $this->endpoint . $function;
        $errorMsg = null;
        $headers = [];

        if ($sendAsJson) {
            $headers[] = 'Content-Type: application/json';
            $params = json_encode($params);
        }

        $options = [CURLOPT_POST => true, CURLOPT_HEADER => false, CURLOPT_AUTOREFERER => true, CURLOPT_CONNECTTIMEOUT => 10,
                CURLOPT_HTTPHEADER => $headers, CURLOPT_TIMEOUT => $this->timeout, CURLOPT_POSTFIELDS => $params,
                CURLOPT_SSLVERSION => CURL_SSLVERSION_TLSv1_2, CURLOPT_SSL_VERIFYPEER => false, CURLOPT_SSL_VERIFYHOST => false,
                CURLOPT_RETURNTRANSFER => 1];
        $curl = curl_init($endpoint);
        curl_setopt_array($curl, $options);
        curl_setopt($curl, CURLOPT_HEADERFUNCTION, [$this, "handleHeaderLine"]);

        // Check if any error occurred
        if (curl_errno($curl)) {
            $errorMsg = 'CURL error: ' . curl_error($curl);
        }

        $APIResponse = curl_exec($curl);
        if ($APIResponse === false) {
            $errorMsg = 'CURL error: ' . curl_error($curl);
        }

        curl_close($curl);

        if ($errorMsg) {
            throw new ServiceException(ErrorCodes::API_COMM_ERROR, $errorMsg);
        }
        if (!$APIResponse && !startsWith('2', $this->httpStatus)) {
            // The did not provide any information but responded with an HTTP error status
            throw new ServiceException(ErrorCodes::API_ERROR_STATUS, $this->httpStatus);
        }
        return $this->parseAPIResponse($APIResponse);
    }

    /**
     * Handles header lines returned by a CURL command
     *
     * @param resource $curl
     * @param string $header_line
     * @return number
     */
    function handleHeaderLine($curl, $header_line) {
        $matches = null;
        if (preg_match('/^HTTP[^\s]*\s(\d+)*/', $header_line, $matches)) {
            $this->httpStatus = $matches[1];
        }
        return strlen($header_line);
    }

    /**
     * Parses the response of the Kangxin API and checks if any error was reported.
     * All responses from the API contain 3 fields:+
     * <ul>
     * <li>code: an error code (or empty if no error occurred)</li>
     * <li>message: Explanation of the error (if any)</li>
     * <li>result: Contents of the response of the API function</li>
     * </ul>
     * If an error is reported by the API, an exception will be thrown. Otherwise the function returns the contents of the response
     *
     * @param string $APIResponse
     * @throws ServiceException::
     * @return stdClass
     */
    private function parseAPIResponse($APIResponse) {
        $result = json_decode($APIResponse);

        if (!$result) {
            // Error decoding JSON format
            throw new ServiceException(ErrorCodes::API_INVALID_DATA_FORMAT);
        }

        $errorCode = $result->code;
        if (!isNullOrEmpty($errorCode) && $errorCode != 0) {
            // API returned an error message
            throw new ServiceException(ErrorCodes::API_FUNCTION_ERROR, trim($result->code . ': ' . $result->msg));
        }

        return $result->result;
    }

    /**
     * Returns simulated patient information
     *
     * @return KangxinPatientInfo[]
     */
    private function simulatedData($pageSize, $pageNum) {
        $simulated = '{
          "code": 0,
          "msg": "成功",
          "result": [{
              "sickId": "9900008451",
              "name": "易家玲",
              "sex": "女",
              "birthDate": "1962-07-28 16:00:00",
              "age": 56,
              "currentAddress": "重庆市-渝中区陕西路23号9-4",
              "nation": "中国",
              "identityNumber": "999211196207291528",
              "phone": "99909414092",
              "contactName": "吴先生",
              "contactPhone": "13608387283",
              "relation": "配偶",
              "sickNum": "9991408",
              "residenceNo": "9991408007",
              "nthHospital": 7,
              "actualHospitalDays": 4,
              "admissionTime": "2022-10-08 08:58:02",
              "admissionDepartment": "心内二病区",
              "admissionWard": "29",
              "hospitalAdmission": "患者以“反复心悸7年余，再发4小时。”入院。入院查体：体温36.2℃，脉搏120次/分，呼吸20次/分，血压151/83mmHg。神志清楚，查体合作，唇红无紫绀，颈软，颈静脉无怒张，心音正常，心率130次/分，心律不齐，未闻及杂音，呼吸音清，未闻及罗音，腹软无压痛，肠鸣音正常，双下肢无水肿，四肢肌力正常，病理征未引出。 辅助检查： 我院床旁心电图提示心房扑动。",
              "drugAllergy": "无",
              "doctor": "何云",
              "responsibleNurse": "刘兴琼",
              "dischargeTime": "",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "18",
              "dischargeDiseaseCode": "I49.900",
              "dischargeMainDiagnosis": "心律失常",
              "otherDiseaseCodes": "I48.x04,E78.500,K29.500,E11.900,I50.903,I11.901,I10.x00x027,Z98.800x911,I48.x02",
              "dischargeOtherDiagnoses": "阵发性心房扑动,高脂血症,慢性胃炎,2型糖尿病,心功能Ⅱ级,高血压性心脏病,高血压病2级（高危）,心脏射频消融术后,阵发性心房颤动",
              "dischargeSituation": "患者一般情况可，未诉不适。查体：血压141/83mmHg。神志清楚。双肺呼吸音清，未闻及啰音。心率77次/分，心律齐，未闻及杂音。复查心电图提示窦性心律。",
              "dischargeInstructions": "1、注意休息，适当活动，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂糖尿病饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n 2、院外监测三餐前及餐后2小时血糖，坚持服规律降糖药，建议餐前血糖控制在6-8mmol/L，餐后血糖控制在8-10mmol/L，请定期到上级医院内分泌科随诊，调整降糖方案，防止低血糖发生；若出现头晕、乏力、心悸、胸闷、出汗及抽搐等低血糖症状，请立即测指血糖并立即到医院就诊。\n3、在医师指导下调整用药，禁止自行停药及减量。\n  出院带药：普罗帕酮片100mg 口服 3次/日；利伐沙斑片10mg 口服 1次/日。\n  自备药物：苯磺酸氨氯地平片(络活喜) 5mg 口服 2次/日；阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次，门冬胰岛素注射液 12IU 皮下注射 1次/日(早餐前)；门冬胰岛素注射液 12IU 皮下注射 1次/日(晚餐前)；甘精胰岛素（长秀霖）12U睡前，在医生的指导下调整用药，禁止自行停药及减量。\n4、建议两周至一月后复查，复诊项目：心电图、凝血项、血常规、生化、大便隐血、胸片等，Holter检查（根据患者病情）；院外出现牙龈充血、牙龈出血、皮肤瘀斑瘀点、呕血、黑便、下肢疼痛乏力等症状，请立即到门诊就诊。\n 5、我科门诊随访，若有心悸、胸闷、胸痛、头晕等不适，请立即来院就诊。（心内二科医师办公室电话：023-65855878）。",
              "hospitalized": "入院完善相关辅助检查(2022-07-29 )血气分析: pCO2 31.8↓ mmHg,cK+ 3.34↓ mmol/L,cCl- 109↑ mmol/L,cNa+ 148↑ mmol/L,AG 19.3↑ mmol/L,ctCO2(P) 21.1↓ mmol/L,SBE -3.6↓ mmol/L,SB 21.9↓ mmol/L,AB 20.2↓ mmol/L。血常规+CRP: LYMPH% 12.90↓ %,LYMPH# 0.61↓ 10^9/L,NEUT% 78.20↑ %。随机血糖+电解质七项+血脂七项+肝功检测+肾功四项: LDL-C 4.39↑ mmol/L,TCO2 21.6↓ mmol/L,HDL-C 2.10↑ mmol/L,Cl- 111.0↑ mmol/L,CysC 1.16↑ mg/L,ApoA1 1.79↑ g/L,ApoB 1.13↑ g/L,TC 7.84↑ mmol/L。肌钙蛋白T+Pro-B型钠尿肽: proBNP 724.90↑ ng/L。血栓弹力图（CFMS）普通杯检测: MA 72.7↑ mm。（2022-07-30）床旁心电图提示1、心房扑动（2:1房室传导）2、T波改变。入院予以补钾、抗凝、控制心室率、抗心律失常等对症治疗，患者房扑未见好转，于2022-08-01予以地西泮20mg静脉注射镇静，镇静成功后予以150J直流电同步电复律，复查心电图提示窦性心律。"
            },
            {
              "sickId": "9900020387",
              "name": "庞勇",
              "sex": "男",
              "birthDate": "1961-09-07 16:00:00",
              "age": 59,
              "currentAddress": "重庆市-渝中区重庆市渝中区文化街48号14-12",
              "nation": "中国",
              "identityNumber": "999202196109081213",
              "phone": "99908344254",
              "contactName": "候小霞",
              "contactPhone": "13908344254",
              "relation": "配偶",
              "sickNum": "9994089",
              "residenceNo": "9994089003",
              "nthHospital": 3,
              "actualHospitalDays": 7,
              "admissionTime": "2022-10-05 01:11:59",
              "admissionDepartment": "心内一病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“反复胸闷、胸痛15年，再发5天”入院。入院查体：体温36.5℃，脉搏74次/分，呼吸19次/分，血压130/73mmHg。神情，精神可，双肺呼吸音清，未闻及干湿啰音，心率74次/分，律齐，各瓣膜未闻及病理性杂音，腹部软，无压痛、反跳痛，双下肢无水肿。2021.3.17我院胸部CT平扫：1.左肺下叶前基底段微小浅淡结节影，建议6个月后随访复查； 2.双肺尖肺大泡形成；双肺下叶后基底段少许间质性改变； 3.左冠状动脉前降支支架植入术后。脂肪肝。2021.3.17日我院颈动脉彩超： 1.左侧颈总动脉粥样硬化斑块（混合斑）2.左侧颈动脉窦部前后壁粥样硬化斑块（混合斑）3.右侧颈总动脉上段粥样硬化斑块（软斑）4.右侧颈动脉窦部前壁粥样硬化斑块（软斑）5.右侧颈动脉窦部后壁粥样硬化斑块（混合斑）6.双侧椎动脉血流阻力指数增高。",
              "operationLevel": "3",
              "operationSurgeon": "赵小松",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-09-08",
              "drugAllergy": "无",
              "doctor": "黎德才",
              "responsibleNurse": "魏如艳",
              "dischargeTime": "",
              "dischargeDepartment": "心内一病区",
              "dischargeWard": "17",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.000,K29.500,K76.000,I70.900x007,E11.900,I50.903,Z95.501",
              "dischargeOtherDiagnoses": "不稳定型心绞痛,慢性胃炎,脂肪肝,外周动脉粥样硬化,2型糖尿病,心功能Ⅱ级,冠状动脉支架植入后状态",
              "dischargeSituation": "患者未再诉胸痛等不适，一般情况可，查体：BP115/60mmHg，心率66次/分，心肺腹部查体未见异常。",
              "dischargeInstructions": "1.低盐低脂糖尿病饮食，戒烟、戒酒，避免营养浓茶、咖啡，避免情绪激动、劳累、熬夜、受凉，家庭监测血压（血压不低于90/50mmHg）、心率（不超过100次/分，不低于50次/分）。  \n2.院外继续口服药物（禁止自行调整用药及停药）：\n     阿司匹林肠溶片(拜阿司匹灵) 0.1g 口服 1次/日；\n     替格瑞洛片(倍林达) 60mg 口服 2次/日；\n     阿托伐他汀钙片(立普妥) 20mg 口服 1次/日；\n     依折麦布片(益适纯) 10mg 口服 1次/日；\n     尼可地尔片(喜格迈) 5mg 口服 3次/日；\n     盐酸地尔硫缓释胶囊（Ⅱ） 90mg 口服 2次/日；\n     沙库巴曲缬沙坦钠片 25mg 口服 2次/日（注意监测血压）。\n  降糖药物：盐酸二甲双胍缓释片 0.5g 口服 2次/日；\n3.注意药物不良反应：胃肠道不适，出血倾向：皮下瘀斑，瘀点，胃肠道出血、黑便、血尿等，无明显诱因出现肌肉疼痛，如出现上述不适，立即就医。\n4.出院后每月门诊定期复查，随访项目：血常规、肝肾功、血脂、血糖，根据医生意见调整用药，若有不适及时心内科随访。刘建平主任门诊时间：每周一到周五（请提前电话确认门诊时间有无改动 023-65855867）。",
              "hospitalized": "入院后完善相关检查：糖化血红蛋白: HbA1c 6.8↑ %。血脂七项: LDL-C 2.18 mmol/L。血常规。肝肾功能、电解质、凝血功能、心肌标志物快检、PRO-BNP、甲功、感染标志物、大小便常规未见异常。心电图：正常心电图。心脏彩超：EF=62％,1.左房稍大2.三尖瓣轻度反流3.左室后间隔、下壁基底段室壁略变薄、动度略降低，内膜回声增强4.左室舒张松弛减低5.左室假腱索。胸部CT平扫：1.左肺下叶前基底段微小浅淡结节影，与2021-03-17胸部CT片比较变化不大，建议年度随访；2.双肺间质性改变；双肺上叶间隔旁型肺气肿并少许肺大泡形成； 3.心脏增大；主动脉硬化；冠状动脉支架植入术后。入院后予以双联抗血小板聚集、调脂稳斑、改善心肌缺血及心室重构、降糖等治疗。于2022.9.8日在局麻下行冠状动脉造影术，显影见右冠优势型，左主干未见明显异常，前降支开口狭窄约50%，前降支原支架内血流通畅，中段原支架内局限性狭窄约60%；第一对角支开口狭窄约90%，前向血流TIMI 3级；回旋支近段狭窄约40%，前向血流TIMI 3级。右冠状动脉中段狭窄约40%，左室后支近段狭窄约60-70%，前向血流TIMI 3级。术后继续予以阿司匹林、替格瑞洛抗血小板、阿托伐他汀钙片、依折麦布调脂等治疗，现患者未诉胸痛，要求今日出院，予以办理。"
            },
            {
              "sickId": "9900011719",
              "name": "陈小平",
              "sex": "女",
              "birthDate": "1953-04-18 16:00:00",
              "age": 67,
              "currentAddress": "重庆市-巴南区巴南区李家沱街道融汇大道2号17幢2-2",
              "nation": "中国",
              "identityNumber": "99900219530419004X",
              "phone": "99908380646",
              "contactName": "陈勇",
              "relation": "子",
              "sickNum": "9992138",
              "residenceNo": "9992138003",
              "nthHospital": 3,
              "actualHospitalDays": 12,
              "admissionTime": "2022-09-29 07:41:08",
              "admissionDepartment": "心内三病区",
              "admissionWard": "38",
              "hospitalAdmission": "患者以“反复胸闷3年。”入院。入院查体：体温36.5℃，脉搏56次/分，呼吸20次/分，血压115/55mmHg。神志清楚，步入病房。双肺呼吸音清，未闻及干湿啰音。心脏听诊律齐，心率56次/分，各瓣膜听诊区未闻及病理性杂音。腹软，无压痛、反跳痛及肌紧张。双下肢无水肿。 2019-07-03 我院 冠脉造影：前降支近中远段弥漫性狭窄约60-90%，回旋支中远段弥漫性狭窄约60-90%，右冠状动脉近段发出圆锥支后完全闭塞。右冠植入2枚支架。2019-07-11 我院 冠脉造影及支架植入术及血管内超声检查术：右冠状动脉远端及近端支架内未见再狭窄，右冠脉中段管腔中-重度狭窄约60-80%，IVUS导管至右冠脉检查，见右冠脉远端及近端支架贴壁好，中段管腔中-重度狭窄约60-80%，最小管腔面积3.54mm2，于右冠脉中段重度狭窄处植入支架1枚，回旋支中段重度狭窄处植入支架1枚，左主干-前降支及前降支中段植入支架共2枚。",
              "operationLevel": "3",
              "operationSurgeon": "何云、赵小松",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-07-11",
              "drugAllergy": "有",
              "doctor": "何云",
              "responsibleNurse": "龚忠梅",
              "dischargeTime": "",
              "dischargeDepartment": "心内三病区",
              "dischargeWard": "21",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.801,K76.000,I70.900x007,I47.200,I49.300x001,I47.101,I49.900,I35.100,I50.903,Z95.501,I25.207",
              "dischargeOtherDiagnoses": "稳定型心绞痛,脂肪肝,外周动脉粥样硬化,室性心动过速,频发性室性期前收缩,房性心动过速,心律失常,主动脉瓣关闭不全,心功能Ⅱ级,冠状动脉支架植入后状态,陈旧性下壁心肌梗死",
              "dischargeSituation": "患者神志清楚，胸闷较前有所缓解。精神、食欲、睡眠尚可，大小便正常。",
              "dischargeInstructions": "1.遵医嘱服药（在医生的指导下调整用药，禁止自行停药及增减量）：\n       硫酸氢氯吡格雷片75mg  口服 1次/日\n       阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次\n        依折麦布片10mg  口服 1次/日\n       沙库巴曲缬沙坦钠片(诺欣妥)50mg  口服 2次/日\n        盐酸曲美他嗪片(万爽力)20mg  口服 3次/日\n  \n 自备药品:请于门诊购买:\n    呋塞米片20mg  口服  隔日1次\n    螺内酯片20mg  口服  隔日1次\n    辅酶Q10片 10mg  口服 3次/日(饭后)\n \n2、心脏康复建议：注意休息，适当活动，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，低盐低脂饮食，多进食新鲜果蔬，避免进食高胆固醇食物，避免进食咖啡、浓茶。     \n3、规律监测血压情况，每日至少晨起未服用降压药物前及夜间入睡前测量血压，测量前排空膀胱，坐立位并休息至少5分钟，避免交谈或写作，每次测量同一侧上肢的血压（血压高的一侧），间隔1到2分钟测量两次，取平均值，并记录血压、心率值。（90/60mmHg＜血压＜140/90mmHg，心率控制在55-90次/分）\n4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便、乏力以及血压低于90/60mmHg、心率低于55次/分请及时门诊就诊；随访血常规、肝功、肾功、血脂、凝血、电解质、大便隐血等指标。\n5、1月后复诊，心内科门诊随访，如有不适，及时就诊。心内三科咨询电话：023-65855980。",
              "hospitalized": "此次入院查心电图:1、窦性心律 2、频发室性早搏(呈二联律)3、提示陈旧性下壁心肌梗死（请结合临床）4、T波改变。动态心电图:1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测22小时33分,总心搏数79639，平均心率58次/分，最快心率129次/分，发生在D2 10:00:28；最慢心率42次/分，发生D1 23:17:32) 2、偶发多源房性早搏，短阵房性心动过速(全程125次，房速5阵) 3、频发室性早搏(全程2721次) 4、T波改变：大部分时间见多导联T波低平，ST段未见异常。 心脏超声:PCI术后：1.左房稍大2.三尖瓣重度反流3.主动脉瓣轻度钙化，重度反流4.二尖瓣稍增厚，中重度反流5.左室下壁及后壁基底段室壁变薄，运动降低，心内膜回声稍增强，考虑陈旧性心肌梗死改变6.左室舒张功能减退7.心脏搏动不规则。建议结合心电图检查。 下肢血管超声:1.左侧股总动脉后壁粥样硬化斑块（软斑）；2.右侧股总动脉粥样硬化斑块（软斑）。 颈部血管超声:1.左侧颈动脉窦部粥样硬化斑块（混合斑）；2.右侧锁骨下动脉起始段粥样硬化斑块（软斑）；3.右侧颈动脉窦部粥样硬化斑块（软斑）；4.右侧椎动脉起始段粥样硬化斑块（软斑）。 腹部超声:1.脂肪肝；2.左肾内囊性暗区，囊肿？3.胆、胰、脾、右肾超声未见明显异常。B型钠尿肽前体 326.60pg/mL ↑，血常规、肝功、肾功、电解质、肌钙蛋白I、血糖、甲功未见明显异常。入院后予以护心、纠正心衰、防治心脏重构、抗血小板聚集、稳定斑块、对症等治疗。并于07-11行冠状动脉造影术，显影见左主干未见狭窄，前降支近中远段支架通畅，支架以远局限性狭窄狭窄约60-70%，前向血流TIMI 3级；回旋支中远支架内局限性狭窄约60%，前向血流TIMI 3级。右冠状动脉原支架通畅，后侧支开口狭窄约60%，后降支开口及近段弥漫性狭窄约40-60%。前向血流TIMI 3级。"
            },
            {
              "sickId": "9900016172",
              "name": "董智宇",
              "sex": "男",
              "birthDate": "1999-03-20 16:00:00",
              "age": 21,
              "currentAddress": "重庆市-垫江县重庆市垫江县新民镇双河口村1组120号",
              "nation": "中国",
              "identityNumber": "999231199903211015",
              "phone": "99923619921",
              "contactName": "黄周玉",
              "relation": "父母",
              "sickNum": "9993222",
              "residenceNo": "9993222003",
              "nthHospital": 3,
              "actualHospitalDays": 14,
              "admissionTime": "2022-09-26 04:16:31",
              "admissionDepartment": "心内二病区",
              "admissionWard": "29",
              "hospitalAdmission": "患者以“发现右心增大4+年，发作性意识丧失2年”入院。入院查体：体温36.2℃，脉搏77次/分，呼吸19次/分，血压88/58mmHg。 神清，精神可，查体合作，颈静脉无怒张，双肺呼吸音清，未闻及明显干湿啰音。心率77次/分，心律不齐，三尖瓣听诊区可闻及收缩期3/6柔和吹风样杂音，余各瓣膜区听诊未闻及明显病理性杂音。腹软，无压痛。双下肢无水肿。 2022-06-27重庆市垫江县中医院动态心电图：1.心律：窦性+异位心律。2.总心室率108124次，平均心率67次/分，最快心率95次/分，最慢心率51次/分。3.室上性早搏总数45次，呈多源，其中单个45次。4.室性早搏总数38832次（占35.91%），其中单个9503次，成对1866次，二联律604阵，三联律53阵，短阵室速880阵，最长2116次；5.ST段：未见明显异常。T波：部分时间II、III、AVF、V4-V6导联低平或倒置。2022-07-13我院动态心电图:1、窦性心律伴窦性心动过缓(全程监测23小时07分,总心搏数79442，平均心率57次/分，最快心率88次/分，发生在D1 14:52:14；最慢心率43次/分，发生D2 03:07:09) 2、偶发房性早搏(全程6次) 3、多源室性早搏，短阵室性心动过速(全程635次，室速29阵) 4、QRS波增宽错综复杂切迹及异常Q波（提示与右室心肌病有关） 5、T波改变：大部分时间见TII、III、aVF，V3-V6低平，ST段未见异常。血常规：血小板计数 106.0010^9/L ↓。肾功：肌酐 99μmol/L ↑。B型钠尿肽前体 766.20pg/mL ↑。甲功：三碘甲状腺原氨酸 1.23nmol/L ↓。感染标志物、肝功、电解质、凝血象未见明显异常。心电图：1、窦性心律2、频发多源室性早搏3、多导联异常Q波（请结合临床）4、肢导联QRS波低电压5、T波改变及QT间期延长。心脏彩超：1.右心、左室增大，右室流出道室壁瘤形成，心室壁回声增强，左室壁运动收缩不同步，考虑致心律失常性右室心肌累及左室2.三尖瓣轻度反流3.左、右心功能降低（建议一般情况好转后门诊复查）。胸片：双肺未见明显实质性病变，侧位片显示膈面粘连。",
              "operationLevel": "4,2,2",
              "operationSurgeon": "龙德勇,龙德勇,龙德勇",
              "operationCode": "37.3401,37.2600x001,37.0x00x002",
              "operationName": "经导管心脏射频消融术,术中心脏电生理检查,心包穿刺引流术",
              "operationDate": "2022-07-25,2022-07-25,2022-07-25",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "林娟",
              "dischargeTime": "",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "11",
              "dischargeDiseaseCode": "I42.800x006",
              "dischargeMainDiagnosis": "致心律失常性左室心肌病",
              "otherDiseaseCodes": "I47.200,I51.700x014,I51.704,I50.903,I51.700x015,I49.300x001",
              "dischargeOtherDiagnoses": "室性心动过速,左室扩大,右房扩大,心功能Ⅱ级,右室扩大,频发性室性期前收缩",
              "dischargeSituation": "患者神志清楚，心悸较前明显缓解，无黑矇、晕厥等意识丧失。精神、食欲、睡眠尚可，大小便正常。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n2、遵医嘱服药（在医生的指导下调整用药）：    \n     盐酸美西律片 100mg 口服 3次/日\n      琥珀酸美托洛尔缓释片(倍他乐克) 71.25mg 口服 1次/日\n      辅酶Q10片(能气朗) 10mg 口服 3次/日\n      螺内酯片(安体舒通) 20mg 口服 1次/隔日\n      呋塞米片20g  口服 1次/隔日   \n3、监测血压、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。\n4、心内科门诊随访，如有不适，立即就诊。心内二科医生办公室电话：65855878。",
              "hospitalized": "此次入院查动态心电图:1、窦性心律伴窦性心动过缓(全程监测23小时07分,总心搏数79442，平均心率57次/分，最快心率88次/分，发生在D1 14:52:14；最慢心率43次/分，发生D2 03:07:09) 2、偶发房性早搏(全程6次) 3、多源室性早搏，短阵室性心动过速(全程635次，室速29阵) 4、QRS波增宽错综复杂切迹及异常Q波（提示与右室心肌病有关） 5、T波改变：大部分时间见TII、III、aVF，V3-V6低平，ST段未见异常。入院后予以抗心律失常、维持水电解质平衡、对症等治疗。并于07-25行心内电生理检查术及射频消融术+心包穿刺术，最后诊断：致心律失常性右室心肌病、频发室性早搏、室性心动过速（右室底部外膜） 。术后予以预防感染、抗心律失常、对症等治疗。"
            },
            {
              "sickId": "9900001110",
              "name": "夏来梅",
              "sex": "女",
              "birthDate": "1964-10-25 16:00:00",
              "age": 54,
              "currentAddress": "重庆市-大渡口区大渡口区建胜镇新建村4号附57号",
              "nation": "中国",
              "identityNumber": "999213196410265029",
              "phone": "99996158862",
              "contactName": "刘启元",
              "relation": "配偶",
              "sickNum": "9990113",
              "residenceNo": "9990113015",
              "nthHospital": 15,
              "actualHospitalDays": 2,
              "admissionTime": "2022-09-20 03:35:45",
              "admissionDepartment": "心内一病区",
              "admissionWard": "29",
              "hospitalAdmission": "患者以“阵发性心悸8年，再发1周”入院。入院查体：体温36.6℃，脉搏68次/分，呼吸20次/分，血压104/79mmHg。神清，查体合作，颈静脉无怒张，双肺呼吸音清，未闻及明显干湿啰音。心率68次/分，律齐，各瓣膜区听诊未闻及明显病理性杂音。腹软，无压痛。双下肢无水肿。 （2022-08-26大坪医院）心脏超声：左房增大（前后径46mm），左室壁活动度减弱，三尖瓣中度反流，二尖瓣中度反流，肺动脉瓣少量反流，左室收缩、舒张功能降低。辛普森法：EF=45%。甲功三项：TSH 7.47uIU/ml，FT3、FRT4正常。心衰标志物580.02pg/ml。。",
              "drugAllergy": "无",
              "doctor": "黎德才",
              "responsibleNurse": "魏如艳",
              "dischargeTime": "",
              "dischargeDepartment": "心内一病区",
              "dischargeWard": "17",
              "dischargeDiseaseCode": "I49.900",
              "dischargeMainDiagnosis": "心律失常",
              "otherDiseaseCodes": "I47.101,G47.900,G90.900x002,K29.500,E03.900,Z98.800x405,I80.303,I50.903,I25.500,I25.103,Z98.800x911,I48.x01,I48.x03",
              "dischargeOtherDiagnoses": "房性心动过速,睡眠障碍,植物神经功能紊乱,慢性胃炎,甲状腺功能减退症,先天性心脏病术后,下肢静脉血栓形成,心功能Ⅱ级,缺血性心肌病,冠状动脉粥样硬化性心脏病,心脏射频消融术后,心房颤动,心房扑动",
              "dischargeSituation": "患者一般情况可，诉无明显心悸、气促、胸闷不适，查体：心率65次/分，血压95/65mmHg。双肺呼吸音清，未闻及明显干湿啰音。心律齐，各瓣膜区听诊未闻及明显病理性杂音。腹软，无压痛。双下肢无水肿。",
              "dischargeInstructions": "1、出院后继续规律用药（在医生的指导下调整用药，禁止自行停药及增减量）：\n    利伐沙班片(班瑞吉) 15mg 口服 1次/日；沙库巴曲缬沙坦钠片(50mg、国谈) 50mg 口服 2次/日；琥珀酸美托洛尔缓释片23.75mg 口服 1次/日；阿托伐他汀钙片(优力平) 20mg 口服 每晚一次；左甲状腺素钠片(优甲乐) 50μg 口服 1次/日；呋塞米片 20mg 口服 1次/日；螺内酯片(安体舒通) 20mg 口服 1次/日；百乐眠胶囊 4片 口服 2次/日；奥氮平片(欧兰宁) 2.5mg 口服 每晚一次。\n2、心脏康复建议：低盐低脂饮食，多进食新鲜果蔬，避免进食高胆固醇食物，避免进食咖啡、浓茶；避免受凉、劳累、情绪激动，放松心情，保证充足睡眠，适当进行有氧活动。 \n3、规律监测血压（不低于90/60mmHg）、心率，观察药物不良反应：出血倾向，注意有无皮下淤斑、淤点、鼻出血、牙龈出血、胃肠道出血、黑便、血尿等；注意有无肌肉酸痛等；定期复查项目：血常规、肝肾功、血脂、血糖、糖化血红蛋白、凝血项、甲功、电解质、心衰标志物，心电图及动态心电图、动态血压、心脏彩超等检查。\n4、定期门诊随访，如有不适，立即就诊。心内三病区电话：023-65855980。",
              "hospitalized": "入院后完善相关检查：(2022-08-27)血常规+CRP: CRP <5.00 mg/L,WBC 7.50 10^9/L,RBC 4.75 10^12/L,Hb 149.00 g/L,PLT 235.00 10^9/L,NEUT% 77.10↑ %,hs-CRP <0.50 mg/L；肝功检测+随机血糖+电解质七项+肾功四项+血脂七项: TG 2.38↑ mmol/L,Cr 101↑ μmol/L,UA 364↑ μmol/L,CysC 1.19↑ mg/L；肌钙蛋白T: cTnT 114.50↑↑ pg/ml；尿液分析（11项）+尿沉渣定量: ERY 1+*。心肌标志物快检、凝血检测、降钙素原、大便常规及隐血未见明显异常。心电图：1、房性心动过速（2:1传导） 2、V1-V3导联异常Q波 3、完全性右束支阻滞 4、ST-T改变。下肢血管超声：双侧胫后静脉管腔内血流淤滞。胸片：左下肺少许纤维灶可能。动态心电图：1、房性心动过速(全程监测23小时30分,总心搏数97174，平均心室率69次/分，最快心室率134次/分，发生在D1 18:29:04；最慢心室率47次/分，发生D2 05:37:14) 2、偶发多源室性早搏(全程781次) 3、V1-V3导联异常Q波 4、完全性右束支阻滞 5、见≥2.0秒长R-R间期有8次，于02:18:44见最长2.28秒（主要发生于夜间，请结合临床） 6、ST-T改变：全程见STII、III、aVF，V4-V6压低0.1mV左右，T波低平、双向、倒置。入院后予以抗凝、利尿、纠正心衰、逆转心室重塑、抗心律失常、补充甲状腺素、助眠等治疗。"
            },
            {
              "sickId": "9900002183",
              "name": "宋世全",
              "sex": "男",
              "birthDate": "2046-06-10 16:00:00",
              "age": 71,
              "currentAddress": "重庆市-江北区铁山坪街道庆坪村沙榜组33号",
              "nation": "中国",
              "identityNumber": "999211194606115119",
              "phone": "99994069873",
              "contactName": "刘洪伟",
              "contactPhone": "13372686241",
              "relation": "子",
              "sickNum": "9990226",
              "residenceNo": "9990226003",
              "nthHospital": 3,
              "actualHospitalDays": 3,
              "admissionTime": "2022-10-01 01:08:41",
              "admissionDepartment": "心内二病区",
              "admissionWard": "33",
              "hospitalAdmission": "患者以“劳力性气促5年，加重伴头昏4天”入院。入院查体：体温36.2℃，脉搏82次/分，呼吸19次/分，血压81/49mmHg。神志清楚，查体合作，双侧眼睑稍苍白，口唇、甲床苍白，颈软，颈静脉无怒张，心音正常，心率82次/分，心律齐，未闻及杂音，呼吸音清，未闻及罗音，腹软无压痛，肠鸣音正常，双下肢无水肿，四肢肌力正常，病理征未引出。 （2017-12-19）心脏彩超：1.右房稍大；主动脉窦部及升主动脉稍增宽2.室间隔增厚，左室间隔及前壁、下壁后壁基底段室壁动度减弱，以后间隔明显3.二尖瓣稍增厚，前瓣尖及瓣下腱索轻度钙化，少量反流4.主动脉瓣稍增厚伴轻度钙化，少量反流，主动脉窦冠临界部粥样硬化斑块形成(硬斑)5.三尖瓣、肺动脉瓣少量反流 6.左室舒张功能减退。",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "赖宏",
              "dischargeTime": "2022-10-03 03:30:00",
              "dischargeDepartment": "CCU病房",
              "dischargeWard": "217",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.900,I70.900x007,E77.801,N19.x00x002,D64.902,K25.900x001,K92.210,E86.x00x001,I50.903,Z95.501,I25.207",
              "dischargeOtherDiagnoses": "心绞痛,外周动脉粥样硬化,低蛋白血症,肾功能不全,中度贫血,胃溃疡,消化道出血,低血容量,心功能Ⅱ级,冠状动脉支架植入后状态,陈旧性下壁心肌梗死",
              "dischargeSituation": "患者诉仍有头昏症状，查体：血压：133/76mmHg，心率：77次/分，双侧眼睑稍苍白，口唇、甲床稍苍白，心律齐，未闻及杂音，呼吸音清，未闻及罗音，腹软无压痛，肠鸣音正常，双下肢无水肿。",
              "dischargeInstructions": "综合医院消化科进一步治疗。",
              "hospitalized": "患者入院后积极完善血常规：白细胞计数 9.7410^9/L↑,红细胞计数 3.7910^12/L↓,血红蛋白 116.00g/L↓,血细胞比容 0.373L/L↓,超敏C反应蛋白（金标法） >5.0mg/L↑,C反应蛋白(金标法) 42.98mg/L↑；肾功：尿素 17.5mmol/L↑,肌酐 205μmol/L↑,胱抑素C 2.45mg/L↑,肝功：总蛋白 54.0g/L↓,白蛋白 31.8g/L↓,电解质：总钙浓度 2.08mmol/L↓,磷 0.69mmol/L↓,二氧化碳总量 20.4mmol/L↓,高密度脂蛋白胆固醇 0.77mmol/L↓；降钙素原 0.180ng/ml↑,B型钠尿肽前体 487.40pg/mL↑；大便常规+隐血：性状 稀,镜检红细胞 3+个/HP,潜血试验 阳性(+)。Rh血型 阳性,血常规：嗜酸性粒细胞绝对值 0.0110^9/L↓,单核细胞百分比 10.80% ↑,嗜酸性粒细胞百分比 0.20%↓,红细胞计数 3.4710^12/L↓,血红蛋白 104.00g/L↓,血细胞比容 0.340L/L ↓,平均红细胞血红蛋白浓度 306.00g/L↓,血小板压积 0.15%↓。心电图：窦性心律，正常心电图。心脏彩超：1.左房稍大；室间隔增厚；主动脉窦部及升主动脉稍增宽2.三尖瓣轻度反流 3.主动脉瓣稍增厚并钙化，轻度反流4.左室舒张功能减退5.局限性心包积液。下肢血管彩超：1.双下肢动脉内膜面粗糙2.双侧股总动脉、股浅动脉、股深动脉、腘动脉粥样硬化斑块（硬斑、混合斑）3.左侧大隐静脉曲张。腹部彩超：1.肝囊肿2.右肾结晶，左肾囊肿3.胰、脾超声未见明显异常。积极予以艾司奥美拉唑抑酸、护胃、生长抑素微量泵泵入、去甲肾上腺素+冰生理盐水口服止血，双歧杆菌调节肠道菌群、补液、补充水电解质平衡等对症支持治疗。07-16复查血常规：血红蛋白 99.00g/L↓,血细胞比容 0.316L/L↓。电解质：氯离子浓度 110.3mmol/L↑,总钙浓度 2.08mmol/L↓,磷 0.63mmol/L↓,二氧化碳总量 21.1mmol/L↓,肾功：尿素 19.8mmol/L↑,肌酐 182μmol/L↑,总蛋白 50.9g/L↓,白蛋白 30.8g/L↓。大便常规+隐血：性状 稀,真菌 少,镜检红细胞 0-1个/HP,潜血试验 阳性(+)。07-17复查血常规：白细胞计数 3.4110^9/L"
            },
            {
              "sickId": "9900005232",
              "name": "董建强",
              "sex": "男",
              "birthDate": "1958-07-16 16:00:00",
              "age": 62,
              "currentAddress": "重庆市-江北区重庆市江北区洋河一村20号17-1",
              "nation": "中国",
              "identityNumber": "999211195807170055",
              "phone": "99978404311",
              "contactName": "赵女士",
              "relation": "配偶",
              "sickNum": "9992266",
              "residenceNo": "9992266016",
              "nthHospital": 16,
              "actualHospitalDays": 10,
              "admissionTime": "2022-09-26 14:40:44",
              "admissionDepartment": "心内三病区",
              "admissionWard": "42",
              "hospitalAdmission": "患者以“反复心悸、胸闷、气促7+年，再发3天。”入院。入院查体：体温36.3℃，脉搏86次/分，呼吸18次/分，血压86/55mmHg。 神清合作，颈软，未见明显颈静脉怒张，双肺呼吸音清，未闻及干湿性啰音，全心增大，心率90次/分，律不齐，二尖瓣听诊区可闻及3/6级收缩期吹风样杂音，腹软无压痛，双下肢无水肿。  无。",
              "drugAllergy": "无",
              "doctor": "何云",
              "responsibleNurse": "刘芳君",
              "dischargeTime": "2022-10-09 04:00:00",
              "dischargeDepartment": "心内三病区",
              "dischargeWard": "26",
              "dischargeDiseaseCode": "I42.000",
              "dischargeMainDiagnosis": "扩张型心肌病",
              "otherDiseaseCodes": "I51.700x009,N18.900x005,I70.900x007,I10.x00x023,E05.900x001,I50.904,I27.200x011,Z95.000x002,I47.200,I49.300x001,I45.501,I48.x02,I48.x04,I35.100,I34.000",
              "dischargeOtherDiagnoses": "心脏扩大,慢性肾功能不全,外周动脉粥样硬化,高血压病1级（高危）,甲状腺功能亢进症,心功能Ⅲ级,左心疾病相关性肺动脉高压,具有心脏再同步治疗除颤器(CRT-D),室性心动过速,频发性室性期前收缩,窦房传导阻滞,阵发性心房颤动,阵发性心房扑动,主动脉瓣关闭不全,二尖瓣关闭不全",
              "dischargeSituation": "现患者精神、饮食可，心悸、胸闷症状缓解，无胸痛、黑矇、晕厥，查体：血压99/70mmHg，心率75次/分，双肺呼吸音清，未闻及干湿性啰音，全心增大，心律齐，二尖瓣听诊区可闻及3/6级收缩期吹风样杂音，腹软无压痛，双下肢无水肿。",
              "dischargeInstructions": "1、出院后继续规律用药（在医生的指导下调整用药，禁止自行停药及增减量）：\n   出院带药：盐酸曲美他嗪片(万爽力) 20mg（1片） 口服 3次/日；\n             地高辛片 0.125mg（半片） 口服 1次/日；\n             芪苈强心胶囊 1.2g（4粒） 口服 3次/日；\n             利伐沙班片(班瑞吉) 15mg（1.5片） 口服 1次/日；\n             琥珀酸美托洛尔缓释片(倍他乐克) 47.5mg（1片） 口服 1次/日；\n   自备药物：螺内酯片(安体舒通) 20mg 口服 1次/日；\n             呋塞米片 20mg 口服 1次/日；\n             辅酶Q10片(能气朗) 10mg 口服 3次/日；\n             达格列净片(安达唐、国谈) 10mg 口服 1次/日（注意血糖）。\n2、心脏康复建议：继续戒烟酒，低盐低脂糖尿病饮食，多进食新鲜果蔬，避免进食高胆固醇食物，避免进食咖啡、浓茶；避免受凉、劳累、情绪激动，放松心情，保证充足睡眠；保持大小便通畅。 \n3、监测血糖，根据血糖值调整降糖治疗方案，随身自备小饼干、糖果等，避免发生低血糖。\n4、规律监测血压、心率，观察药物不良反应：出血倾向，注意有无皮下淤斑、淤点、鼻出血、牙龈出血、胃肠道出血、黑便、血尿等；注意有无肌肉酸痛等；定期复查项目：血常规、肝肾功、血脂、血糖、糖化血红蛋白、凝血项、电解质、心衰标志物，心电图及动态心电图、动态血压、心脏彩超等检查。\n5、监测尿量、体重，注意自身出入量管理。1月左右门诊复查甲功，3-6个月复查心脏超声等检查。\n6、定期门诊随访，如有不适，立即就诊。心内三科电话：023-65855980。",
              "hospitalized": "入院后完善相关检查：2022-07-07 22:50:27心电图：1、心房颤动 2、偶发室性早搏3、不定型室内阻滞 4、ST-T改变5、起搏心电图：起搏器呈心室起搏工作方式，起搏频率75次/分。2022-07-08 8:43:29心电图：1、窦性心律 2、提示左房肥大（请结合心脏超声） 3、偶发多源室性早搏4、起搏心电图：起搏器呈心房感知/心室起搏、心房起搏/心室起搏工作方式，起搏频率75次/分。2022-07-08 10:51:48心电图：1、心房颤动 2、不定型室内阻滞 3、ST-T改变4、起搏心电图：起搏器呈心室起搏工作方式，起搏频率75次/分。心脏彩超： 1.左房、左室明显增大，右房、右室稍大2.二尖瓣重度反流（功能性）3.三尖瓣轻度反流；估测肺动脉压力增高4.主动脉瓣增厚并轻度钙化，轻度反流5.右心起搏器6.左室壁运动普遍减弱；左心功能显著降低，右心功能稍降低。血常规：嗜酸性粒细胞百分比 6.70% ↑,红细胞计数 3.5310^12/L ↓,血红蛋白 112.00g/L ↓,血细胞比容 0.345L/L ↓,血小板压积 0.16% ↓。糖化血红蛋白定量 6.2% ↑。凝血：凝血酶原时间测定 16.1s ↑,活化部分凝血活酶时间 42.4s ↑。肌钙蛋白I <0.020ng/ml ,肌酸激酶同工酶 <1.00ng/ml ,肌红蛋白 <20.00ng/ml 。B型钠尿肽前体 4463.00pg/mL ↑,肌钙蛋白T 74.06pg/ml ↑。肝肾功：尿素 11.7mmol/L ↑,肌酐 147μmol/L ↑,尿酸 630μmol/L ↑,胱抑素C 2.61mg/L ↑,二氧化碳总量 20.0mmol/L ↓。甲功：促甲状腺激素 6.72uIU/ml ↑,三碘甲状腺原氨酸 1.07nmol/L ↓。尿常规：葡萄糖 3+ *,潜血 ± *。给予强心、利尿、改善循环等对症治疗。"
            },
            {
              "sickId": "9900007860",
              "name": "夏太富",
              "sex": "男",
              "birthDate": "1950-10-05 16:00:00",
              "age": 68,
              "currentAddress": "重庆市-沙坪坝区重庆市沙坪坝区华宇广场1号22-15",
              "nation": "中国",
              "identityNumber": "999212195010062117",
              "phone": "99908311466",
              "contactName": "谭红",
              "relation": "配偶",
              "sickNum": "9991243",
              "residenceNo": "9991243005",
              "nthHospital": 5,
              "actualHospitalDays": 8,
              "admissionTime": "2022-10-02 02:01:18",
              "admissionDepartment": "心内二病区",
              "admissionWard": "30",
              "hospitalAdmission": "患者以“胸痛、胸闷3年余，再发1月”入院。入院查体：体温36.2℃，脉搏76次/分，呼吸19次/分，血压130/62mmHg。 神清合作，颈软，未见明显颈静脉怒张，双肺呼吸音清，双肺无明显干湿啰音，心率76次/分，律齐，各瓣膜听诊区未闻及病理性杂音，腹软无压痛，双下肢无水肿。 暂缺。",
              "operationLevel": "3,3,3,3,3,3,3,3",
              "operationSurgeon": "何云,何云,何云,何云,何云,何云,何云,何云",
              "operationCode": "39.9016,88.4904,88.4500,88.4200,88.4103,88.5500,00.4000,00.4500",
              "operationName": "肾动脉支架置入术,髂动脉造影,肾动脉造影术,主动脉造影术,颈动脉造影术,单根导管的冠状动脉造影术,单根血管操作,置入一根血管的支架",
              "operationDate": "2022-07-13,2022-07-13,2022-07-13,2022-07-13,2022-07-13,2022-07-13,2022-07-13,2022-07-13",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-10-10 01:40:00",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "18",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.000,I70.900x007,J20.900x004,E11.900,I10.x00x027,Z95.800x003,I77.126,Z95.800x004,I71.004,I50.903,Z95.501,I25.204",
              "dischargeOtherDiagnoses": "不稳定型心绞痛,外周动脉粥样硬化,慢性支气管炎急性发作,2型糖尿病,高血压病2级（高危）,周围血管支架植入术后状态,髂外动脉狭窄,血管支架植入术后状态,腹主动脉夹层,心功能Ⅱ级,冠状动脉支架植入后状态,陈旧性前间壁心肌梗死",
              "dischargeSituation": "患者未诉胸闷、胸痛、咳痰等不适。查体：体温 36.4℃，脉搏62次/分，呼吸19次/分，血压117/66mmHg。神清，双肺呼吸音清，双肺无明显干湿啰音，心率62次/分，律齐，各瓣膜听诊区未闻及病理性杂音，腹软，无压痛，双下肢无水肿。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n  2、遵医嘱服药（在医生的指导下调整用药）：    \n     阿司匹林肠溶片(拜阿司匹灵) 0.1g 口服 1次/日；琥珀酸美托洛尔缓释片(倍他乐克) 47.5mg 口服 1次/日；阿托伐他汀钙片(立普妥) 20mg 口服 1次/晚；盐酸曲美他嗪片(万爽力) 20mg 口服 3次/日；厄贝沙坦片(安博维) 0.15g 口服 1次/日；单硝酸异山梨酯缓释胶囊( Ⅳ) 50mg 口服 1次/晚；阿卡波糖片(拜唐苹) 100mg 口服 3次/日；达格列净片(安达唐、国谈) 10mg 口服 1次/日； \n    3、监测血压、血糖、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，根据血糖情况调整降糖药物剂量，自备糖块，防止低血糖，内分泌科随访。\n   4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便等情况请及时来我院门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。\n   5、心内科门诊随访，如有不适，立即就诊。",
              "hospitalized": "患者入院后完善相关检查： 血常规：血小板计数 86.0010^9/L ↓。糖化血红蛋白定量 8.0% ↑。凝血象：D-二聚体 0.85mg/L FEU ↑,抗凝血酶Ⅲ 66.8% ↓。肌钙蛋白T 26.38pg/ml ↑。感染标志物：梅毒特异性抗体 1.27S/CO ↑。肝肾功、电解质、血脂、心肌标志物、血栓弹力图、甲功未见明显异常。心电图：1、窦性心律 2、提示左房肥大（请结合心脏超声）3、完全性右束支阻滞 4、提示陈旧性前间壁心肌梗死。心脏彩超：1.左房增大，左室稍大，升主动脉稍增宽，室间隔增厚2.左室舒张功能减退3.左室壁节段性运动异常4.主动脉窦管连接部粥样硬化斑块（硬斑）。下肢血管彩超：1.左侧股总动脉后壁粥样硬化斑块（混合斑、软斑）2.左侧股浅动脉粥样硬化斑块（硬斑、混合斑）3.右侧股总动脉后壁粥样硬化斑块（硬斑、混合斑）4.右侧股浅动脉前壁粥样硬化斑块（硬斑）5.双侧腘动脉前后壁粥样硬化斑块（软斑）。腹部彩超：1.轻度脂肪肝，肝内胆管扩张，胆总管扩张2.脾稍大3.左肾实质钙化；右肾囊肿。颈动脉彩超：1.右侧锁骨下动脉起始段粥样硬化斑块（混合斑）2.右侧颈总动脉中段前壁、后侧壁粥样硬化斑块（混合斑）3.右侧颈动脉窦部前、后壁粥样硬化斑块（混合斑）4.右侧颈内动脉起始段前壁粥样硬化斑块（软斑）5.右侧颈内动脉起始段后壁粥样硬化斑块（混合斑），伴管腔轻度狭窄6.右侧颈外动脉起始段后壁粥样硬化斑块（软斑）7.左侧颈动脉窦部后壁粥样硬化斑块（混合斑）8.左侧颈总动脉中段侧壁粥样硬化斑块（混合斑）。头颈部+冠状动脉螺旋CTA：1.冠状动脉右优势型，冠状动脉支架置入术后改变，支架形态完整，支架内血流通畅，支架S1、S3远端开口处低密度斑块形成伴管腔轻中度狭窄；2.左冠状动脉主干钙化斑块形成伴管腔轻度狭窄；前降中远段、回旋支近段及右冠中远段弥漫低密度斑块形成伴管腔轻中度狭窄；3.左冠状动脉钝缘支局限性混合斑块形成伴管腔重度狭窄；4.左心室心尖部室壁变薄，左室壁陈旧性心肌梗死，左室壁增厚；5.主动脉弓粥样硬化，头臂干、左颈总及双锁骨下动脉开口处见非钙化密度斑块形成，管腔轻度狭窄；6.双侧颈总动脉见弥漫性非钙化斑块形成，伴管腔轻微狭窄；右侧颈动脉窦见混合斑块形成，伴管腔中-重度狭窄，左侧颈动脉窦混合密度斑块形成伴管腔轻度狭窄；7.双侧颈内动脉虹吸段见多发钙化斑块形成，管腔轻度狭窄；8.颅内动脉粥样硬化，右侧大脑"
            },
            {
              "sickId": "9900013355",
              "name": "符美华",
              "sex": "男",
              "birthDate": "1953-03-26 16:00:00",
              "age": 66,
              "currentAddress": "四川省达州市万源市四川省万源市石人乡孙家河村符家坡组47号",
              "nation": "中国",
              "identityNumber": "999024195303279130",
              "phone": "99928915628",
              "contactName": "沈来花",
              "relation": "配偶",
              "sickNum": "9992486",
              "residenceNo": "9992486005",
              "nthHospital": 5,
              "actualHospitalDays": 15,
              "admissionTime": "2022-09-28 03:15:08",
              "admissionDepartment": "心内三病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“活动后喘累11年，加重半月。”入院。入院查体：体温36.2℃，脉搏78次/分，呼吸17次/分，血压75/45mmHg。 神志清楚，步入病房，言清语晰，查体合作。双肺呼吸音清，双下肺可闻及少许湿啰音。心脏听诊律齐，心率75次/分，二尖瓣听诊区收缩期杂音。腹软，全腹无压痛、反跳痛及肌紧张。双下肢无水肿。 2021-04-21我院心脏超声:1.左房、左室增大，升主动脉、肺动脉主干及其分支増宽；2.二尖瓣瓣尖增厚，重度反流；3.三尖瓣、主动脉瓣轻度反流；4.左、右心功能降低；5.左室中间段至心尖段心肌结构疏松。2021-04-21我院动态心电图:1、窦性心律伴窦性心动过缓(全程监测23小时19分,总心搏数95084次，平均心率69次/分，最快心率99次/分，发生在D2 10:19:47；最慢心率53次/分，发生D2 04:54:53)；2、偶发房性早搏，短阵房性心动过速(全程825次，房速3阵)；3、偶发多源室性早搏，短阵室性心动过速(全程354次，室速1阵)；4、完全性左束支阻滞；5、提示左房、左室肥大（请结合心脏超声）；6、ST-T改变；7、起搏心电图：起搏器呈心室起搏工作方式，起搏频率50次/分。",
              "drugAllergy": "有",
              "doctor": "王国强",
              "responsibleNurse": "王晨",
              "dischargeTime": "2022-10-11 00:00:00",
              "dischargeDepartment": "心内三病区",
              "dischargeWard": "26",
              "dischargeDiseaseCode": "I42.000",
              "dischargeMainDiagnosis": "扩张型心肌病",
              "otherDiseaseCodes": "I51.703,I34.001,D68.900x003,D64.902,K92.210,J98.414,M10.900,Z98.800x911,I48.x02,I50.904,I44.602,I47.200,I49.300x001,Z95.000,I51.700x014",
              "dischargeOtherDiagnoses": "左房扩大,二尖瓣反流,凝血功能异常,中度贫血,消化道出血,肺部感染,痛风,心脏射频消融术后,阵发性心房颤动,心功能Ⅲ级,完全性左束支传导阻滞,室性心动过速,频发性室性期前收缩,具有心脏起搏器,左室扩大",
              "dischargeSituation": "目前患者一般情况可，喘累较前明显缓解，偶咳嗽2/3声，未解黑便。精神、食欲、睡眠尚可，大小便正常。今日患者要求出院，经请示王国强副主任医师后同意其办理出院。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，减重，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率，遵医嘱规律服药（在医生的指导下调整用药，禁止自行停药及增减量）。\n2、出院带药：      \n      沙库巴曲缬沙坦钠片(50mg、国谈) 25mg 口服 2次/日(注意监测血压)\n      螺内酯片(安体舒通) 20mg 口服 隔日一次(注意下肢水肿、小便量，定期复查电解质)\n      呋塞米片20mg 口服 隔日一次 (注意下肢水肿、小便量，定期复查电解质)\n      利伐沙班片10mg  口服  1次/日\n      泮托拉唑肠溶胶囊20mg   口服  1次/日\n  \n 自备药品:盐酸胺碘酮片(可达龙) 0.2g 口服 1次/日\n          美托洛尔缓释片47.5mg    口服   1次/日\n3、规律监测血压情况，每日至少晨起未服用降压药物前及夜间入睡前测血压，测量前排空膀胱，坐立位并休息至少5分钟，避免交谈或写作，每次测量同一侧上肢的血压（血压高的一侧），间隔1到2分钟测量两次，取平均值，并记录血压、心率值。（90/60mmHg＜血压＜140/90mmHg，心率控制在55-90次/分）\n4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便、乏力以及血压低于90/60mmHg、心率低于55次/分请及时门诊就诊；\n5、半年后复查心脏超声、起搏器程控等。\n6、监测体重（每次清晨不穿或只穿少量衣物、空腹、排尿、排便后，使用统一的体重秤测量体重，若三天内，体重增加2kg以上，请及时就诊，评估利尿方案是否调整）。\n7、定期随访血常规、肝功、肾功、血脂、血糖、凝血、电解质、大便隐血等指标。\n8、心内科门诊随访，如有不适，及时就诊。心内科咨询电话：023-65855878。",
              "hospitalized": "入院查心电图:1、窦性心律；2、偶发室性早搏；3、完全性左束支阻滞；4、提示左房、左室肥大（请结合心脏超声）；5、ST-T改变；6、起搏心电图：起搏器呈心室起搏工作方式，起搏频率60次/分。心脏超声:1.左房、左室增大，升主动脉增宽，肺动脉主干及其分支稍増宽；2.二尖瓣瓣尖增厚，重度反流；3.主动脉瓣中度反流；3.三尖瓣轻度反流；4.左室壁运动普遍降低，左、右心功能降低；5.左室中间段至心尖段心肌结构疏松。下肢血管超声:1.双侧股总动脉粥样硬化斑块（混合斑）；2.双侧股浅动脉粥样硬化斑块（硬斑）。颈部血管超声:1.双侧颈动脉窦部前后壁粥样硬化斑块（混合斑）；2.左侧颈内动脉起始段后壁粥样硬化斑块（软斑）；3.右侧颈静脉内径增宽。 胸片:1.心脏起搏器置入术后，双肺未见明显实质性病变； 2.心影重度增大； 3.胸段脊柱侧弯改变。肾功:尿素 7.0mmol/L ,肌酐 154μmol/L ↑,尿酸 460μmol/L ↑。B型钠尿肽前体 4861.00ng/L ↑，甘油三酯 5.11mmol/L ↑,凝血酶原时间测定 77.5s ↑↑,国际标准化比值 7.77 ↑↑,活化部分凝血活酶时间 59.7s ↑，促甲状腺激素 7.65uIU/ml ↑,游离三碘甲状腺原氨酸 3.50pmol/L ,游离甲状腺素 17.27pmol/L ,三碘甲状腺原氨酸 1.24nmol/L ↓,甲状腺素 94.68nmol/L 。动态血压:1．全天血压平均值82/47mmHg；白天血压平均值80/46mmHg；夜间血压平均值84/48mmHg。2．最高收缩压99mmHg，发生在(12:42)；最高舒张压61mmHg，发生在(05:28)。最低收缩压64mmHg，发生在(17:29)；最低舒张压34mmHg，发生在(18:29)。3．血压负荷（指测量的血压值超过正常血压值的次数占总测量次数的百分比）。全天收缩压负荷0.0%；全天舒张压负荷0.0%。4. 昼夜血压变化规律呈反杓型改变。动态心电图:1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测23小时10分,总心搏数103366，平均心率74次/分，最快心率110次/分，发生在D2 07:06:41；最慢心率58次/分，发生D1 17:53:17) 2、偶发房性早搏(全程19次) 3、频发多源室性早搏，短阵室性心动过速(全程2769次，室速21阵) 4、完全性左束支阻滞 5、提示"
            },
            {
              "sickId": "9900010917",
              "name": "李中鸣",
              "sex": "男",
              "birthDate": "2042-11-27 16:00:00",
              "age": 77,
              "currentAddress": "重庆市-江北区重庆江北区青草坝3号附5号",
              "nation": "中国",
              "identityNumber": "99940019421128741X",
              "phone": "99920339186",
              "contactName": "吴翠华",
              "contactPhone": "13220339186",
              "relation": "配偶",
              "sickNum": "9991936",
              "residenceNo": "9991936007",
              "nthHospital": 7,
              "actualHospitalDays": 7,
              "admissionTime": "2022-09-23 02:41:55",
              "admissionDepartment": "心内一病区",
              "admissionWard": "29",
              "hospitalAdmission": "患者以“反复胸痛38年，反复心悸8年，加重伴黑便4天”入院。入院查体：体温36.6℃，脉搏103次/分，呼吸18次/分，血压105/58mmHg。神清，查体合作，睑结膜苍白，贫血貌，双肺呼吸音清，双肺未闻及明显干湿啰音，心率103次/分，心律齐，各瓣膜区听诊未闻及明显病理性杂音，腹软，上腹部有压痛，无明显反跳痛及肌紧张，双下肢无水肿。 （2020-07-18我院）心脏超声：床旁心脏彩超，检查结果仅供参考：1.左室壁节段性运动异常，室壁瘤形成，室壁瘤内部未见明显血栓形成，必要时结合超声造影或其它检查进一步确定；2.左室收缩功能降低，舒张功能减退，右室收缩功能降低；3.二尖瓣、三尖瓣、主动脉瓣轻度反流；4.左房稍增大，室间隔基底段增厚；5.左室假腱索。左心收缩功能辛普森法：EF=36％；心脏搏动不规则。左心收缩功能测定(M型）：EF＝42％，FS＝21％，EDV＝174ml，SV=73ml。",
              "drugAllergy": "无",
              "doctor": "黎德才",
              "responsibleNurse": "魏如艳",
              "dischargeTime": "2022-09-01 01:00:00",
              "dischargeDepartment": "心内一病区",
              "dischargeWard": "17",
              "dischargeDiseaseCode": "K92.210",
              "dischargeMainDiagnosis": "消化道出血",
              "otherDiseaseCodes": "I25.103,J42.x00,G47.900,E78.500,E11.900,I11.901,I10.x00x031,Z98.800x911,I47.201,I48.x02,I49.900,I50.904,Z95.501,I20.000,I25.301,I25.200",
              "dischargeOtherDiagnoses": "冠状动脉粥样硬化性心脏病,慢性支气管炎,睡眠障碍,高脂血症,2型糖尿病,高血压性心脏病,高血压病3级（高危）,心脏射频消融术后,阵发性室性心动过速,阵发性心房颤动,心律失常,心功能Ⅲ级,冠状动脉支架植入后状态,不稳定型心绞痛,心室壁瘤,陈旧性心肌梗死",
              "dischargeSituation": "患者一般情况可，现胸痛、心悸、腹痛症状已缓解，大便呈黄色，查体：心率57次/分，血压115/59mmHg。双肺呼吸音清，双肺未闻及明显干湿啰音，心律齐，各瓣膜区听诊未闻及明显病理性杂音，腹软，无明显压痛、反跳痛及肌紧张，双下肢无水肿。",
              "dischargeInstructions": "1、出院后继续规律用药（在医生的指导下调整用药，禁止自行停药及增减量）：\n   出院带药：阿托伐他汀钙片(优力平) 20mg 口服 每晚一次；\n              沙库巴曲缬沙坦钠片(50mg、国谈) 50mg 口服 2次/日；\n              达格列净片(安达唐、国谈) 10mg 口服 1次/日；\n              L-谷氨酰胺呱仑酸钠颗粒(麦滋林) 0.67g 口服 3次/日；\n              艾司奥美拉唑镁肠溶片(耐信) 40mg 口服 1次/日(餐前)；\n    自备药物：门冬氨酸钾镁片(潘南金) 1片 口服 3次/日；\n             琥珀酸美托洛尔缓释片(倍他乐克) 23.75mg 口服 1次/日；\n             达比加群酯 110mg 口服 2次/日。\n2、心脏康复建议：低盐低脂糖尿病饮食，多进食新鲜果蔬，避免进食高胆固醇食物，避免进食咖啡、浓茶；避免受凉、劳累、情绪激动，放松心情，保证充足睡眠，适当进行有氧活动。 \n3、监测血糖，根据血糖值调整降糖治疗方案，随身自备小饼干、糖果等，避免发生低血糖。\n4、规律监测血压、心率，观察药物不良反应：出血倾向，注意有无皮下淤斑、淤点、鼻出血、牙龈出血、胃肠道出血、黑便、血尿等；注意有无肌肉酸痛等；定期复查项目：血常规、肝肾功、血脂、血糖、糖化血红蛋白、凝血项、电解质、心衰标志物，心电图及动态心电图、动态血压、心脏彩超等检查。\n5、半年内每月门诊复查。定期门诊随访，如有不适，立即就诊。心内科咨询电话：023-65855980。",
              "hospitalized": "入院后完善相关检查：(2022-09-23)血气分析: PH 7.47↑ ,pCO2 34.6↓ mmHg,PO2 90 mmHg,cLac 2.3↑ mmol/L,SO2 97.6 %,GLU 21.3↑ mmol/L；血常规+CRP: WBC 7.26 10^9/L,Hb 63.00↓ g/L,PLT 149.00 10^9/L,NEUT% 85.20↑ %,Hct 0.196↓ L/L；凝血检测: TT 149.3↑ s；ABO+Rh血型鉴定: Rh（D） 阳性* ,ABO血型 O；电解质七项+随机血糖+肾功四项+血脂七项+肝功检测: TG 3.50↑ mmol/L,K+ 3.65 mmol/L,Na+ 136.7↓ mmol/L,UA 572↑ μmol/L,Glb 19.0↓ g/L,RBG 19.82↑ mmol/L,CysC 1.37↑ mg/L,TP 55.9↓ g/L；Pro-B型钠尿肽+肌钙蛋白T+降钙素原: proBNP 1113.00↑ ng/L,cTnT 30.22↑ pg/ml,PCT 0.125↑ ng/ml；甲功检测: T3 1.19↓ nmol/L；感染标志物: HBsAg 3.16↑ IU/ml,HBeAb 2.55↑ IU/ml,HBcAb >10.00↑ IU/ml；糖化血红蛋白: HbA1c 6.7↑ %；血栓弹力图（CFMS）普通杯检测: R1 9.2↑ min。心肌标志物快检阴性。心电图：1、窦性心律；2、提示前间壁心肌梗死（请结合临床） ；3、偶发交界性早搏；4、完全性右束支阻滞；5、ST-T改变。床旁心脏彩超，检查结果仅供参考：1.左室壁节段性运动异常，室壁瘤形成，室壁瘤处心内膜与心肌组织分离，内部可见血流信号与左心腔相通，考虑心肌夹层可能性大，建议左心造影进一步检查；2.左室收缩功能降低，舒张功能减退；3.主动脉瓣轻中度反流；4.左房稍增大，室间隔基底段增厚；5.左室假腱索；6.右室流出道收缩期流速偏快，建议进一步检查。左心收缩功能辛普森法：EF=35％；心脏搏动欠规则。左心收缩功能测定(M型）：EF＝55％，FS＝28％，EDV＝171ml，SV=100ml。床旁胸片：1.右上肺钙化灶，双肺未见明显实质性病变；2.主动脉硬化。(2022-09-24)血常规: WBC 5.73 10^9/L,Hb 81.00↓ g/L,PLT 120.00↓ 10^9/L,NE"
            },
            {
              "sickId": "9900014742",
              "name": "李先安",
              "sex": "男",
              "birthDate": "1952-12-05 16:00:00",
              "age": 67,
              "currentAddress": "重庆市-江北区重庆市江北区寸滩街道头塘村观音桥组154号",
              "nation": "中国",
              "identityNumber": "999211195212064819",
              "phone": "99994117064",
              "contactName": "李先生",
              "contactPhone": "13594117064",
              "relation": "子",
              "sickNum": "9992848",
              "residenceNo": "9992848003",
              "nthHospital": 3,
              "actualHospitalDays": 7,
              "admissionTime": "2022-07-05 01:19:48",
              "admissionDepartment": "心内一病区",
              "admissionWard": "43",
              "hospitalAdmission": "患者以“胸痛2+年，活动后气促、咳嗽、咳痰2天。”入院。入院查体：体温36.9℃，脉搏98次/分，呼吸24次/分，血压140/111mmHg。查体： 颈软，颈静脉无怒张，肝颈静脉回流征阴性，颈动脉搏动正常，气管居中，甲状腺无肿大，无血管杂音。胸廓呈桶状胸，双肺呼吸音粗，双肺闻及湿啰音及哮鸣音。心前区无异常隆起，心尖搏动正常，心界正常，心率 140次/分，心律不齐，第一心音强弱不等，二尖瓣听诊区可闻及收缩期2/6级吹风样杂音。周围血管征阴性。双下肢无水肿。 门诊（2022-07-05）心电图：1、心房颤动伴快心室率 2、提示陈旧性下壁心肌梗死 3、短阵室性心动过速 4、肢导联QRS波低电压趋势 5、顺钟向转位 6、T波改变。超声心动图示：EF＝51％ 1.左房增大，右房稍大2.二尖瓣膜及瓣下腱索增厚、回声增强，以后瓣明显，轻度狭窄可能，瓣口错位，重度反流3.三尖瓣增厚，重度反流；估测肺动脉收缩压增高4.主动脉瓣缘增厚并轻度钙化，少量反流5.左室壁运动欠协调，请结合临床；左、右室功能降低。。",
              "drugAllergy": "无",
              "doctor": "黎德才",
              "responsibleNurse": "魏如艳",
              "dischargeTime": "2022-07-12 01:00:00",
              "dischargeDepartment": "心内一病区",
              "dischargeWard": "12",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I25.207,E77.801,E79.001,E87.800x011,I07.100,N19.x00x002,K72.905,J44.900,J98.414,I47.200,I49.100x002,I48.x00x007,I49.900,I35.100,I05.200x002,I09.900,I50.905,I50.900,Z95.501",
              "dischargeOtherDiagnoses": "陈旧性下壁心肌梗死,低蛋白血症,高尿酸血症,电解质紊乱,三尖瓣关闭不全,肾功能不全,肝功能不全,慢性阻塞性肺疾病,肺部感染,室性心动过速,频发性房性期前收缩,持续性心房颤动,心律失常,主动脉瓣关闭不全,二尖瓣狭窄伴关闭不全,风湿性心脏病,心功能Ⅳ级,心力衰竭,冠状动脉支架植入后状态",
              "dischargeSituation": "患者活动后未诉气促，无明显咳嗽、咳痰，无畏寒、发热，无眩晕、晕厥、意识不清及抽搐，无肢体活动障碍，大小便正常。查体：血压116/72mmHg。呼吸平稳，无颈静脉怒张，肝颈回流征阴性。双肺呼吸音清，未闻及明显干湿啰音及哮鸣音。心界无明显扩大，心界向左扩大，心率65次/分，心律不齐，第一心音强弱不等，二尖瓣听诊区可闻及收缩期2/6级吹风样杂音。腹软，无压痛、反跳痛及肌紧张，肝脾肋下未及。双下肢无水肿。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，家庭氧疗，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率，遵医嘱规律服药（在医生的指导下调整用药，禁止自行停药及增减量）。\n2、出院带药：\n 富马酸比索洛尔片(康忻) 1.25mg 口服 每天一次；\n 螺内酯片(安体舒通) 20mg 口服 每天一次；\n 甘草酸二铵胶囊(甘利欣) 150mg 口服 每天三次；（随访肝功正常后停药）\n 利伐沙班片(拜瑞妥) 10mg 口服 每天一次；\n 氢氯噻嗪片 12.5mg 口服 每天一次；   \n 自备药（请于门诊购药）： \n 沙美特罗替卡松粉吸入粉雾剂(舒利迭) 1吸 吸入给药 每天二次；\n 孟鲁司特钠片 10mg 口服 每晚一次；\n 泮托拉唑肠溶胶囊 20mg 口服 每天一次 （复查大便常规，正常后半月后停药）\n 阿托伐他汀钙片  20mg  口服 每晚一次；(随访肝功正常后加药)\n3、监测体重（每次清晨不穿或只穿少量衣物、空腹、排尿、排便后，使用统一的体重秤测量体重，若三天内，体重增加2kg以上，请及时就诊，评估利尿方案是否调整）。\n4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便、乏力以及血压低于90/60mmHg、心率低于55次/分请及时门诊或消化内科就诊；\n 5、定期随访血常规、肝功、肾功、血脂、凝血、电解质、大便隐血、BNP等指标。\n5、3个月后复查心脏彩超，1年后复查冠脉造影，心内科门诊随访，如有不适，及时就诊。心内一科咨询电话：023-65855890。",
              "hospitalized": "入院后予以完善相关检查：床旁DR胸部正位：双肺纹理多，右下肺感染性病变可能。血气分析：pCO2 33.2 mmHg,PO2 66 mmHg,AB 18.9 mmol/L,SB 20.3 mmol/L,ABE -4.9 mmol/L,SBE -5.4 mmol/L,ctCO2(P) 19.9 mmol/L,Hct 48 %,SO2 92.5 %,cNa+ 135 mmol/L,Ca(7.4) 1.13 mmol/L,cLac 2.0 mmol/L,pCO2(T) 32.3 mmHg,pO2（T） 63 mmHg,余正常； 心肌标志物快检(POCT)：正常； ABO+Rh血型鉴定+血常规+CRP：WBC 11.41 10^9/L,Rh（D） 阳性 ,NEUT# 9.00 10^9/L,MONO# 0.97 10^9/L,EO# 0 10^9/L,NEUT% 78.90 %,LYMPH% 12.20 %,EO% 0 %,PLT 113.00 10^9/L,PDW 19.60 %,MPV 13.40 fl,P-LCR 50.30 %,PCT 0.15 %,hs-CRP >5.00 mg/L,CRP 15.75 mg/L,余正常； 凝血检测：PT 15.5 s,余正常； 肌钙蛋白T+Pro-B型钠尿肽+降钙素原：cTn T 19.02 pg/ml,proBNP 8810.00 pg/mL,PCT 0.228 ng/ml,余正常； 电解质七项+肝功七项+血脂七项+肾功四项+随机血糖：UREA 15.5 mmol/L,ALT 115 U/L,AST 150 U/L,Na+ 135.5 mmol/L,Cr 166 μmol/L,UA 657 μmol/L,HDL-C 0.82 mmol/L,GGT 230 U/L,Cys C 2.18 mg/L,Apo A1 0.92 g/L,TCO2 20.1 mmol/L,Lp（a） 656.6 mg/L,DBil 8.6 μmol/L,余正常； 尿液分析（11项）+尿沉渣定量：RBC. 133.20 个/μl,PRO ± ,VC 3+ ,余正常； 糖化血红蛋白：正常； 甲功检测：TSH 4.56 uIU/ml,余正常； 感染标志物：HBsAb >1000.00 mIU/ml,余正常；动态心电图示：1、心房颤动(全程监测23小时14分,总心搏数123232，平均心室率92次/分，最快心室"
            },
            {
              "sickId": "9900017633",
              "name": "江义进",
              "sex": "男",
              "birthDate": "1959-10-26 16:00:00",
              "age": 60,
              "currentAddress": "重庆市-北碚区北碚区东阳街道东阳村鲜家湾组8号附1号",
              "nation": "中国",
              "identityNumber": "999215195910273330",
              "phone": "99927554405",
              "contactName": "李群",
              "relation": "配偶",
              "sickNum": "9993535",
              "residenceNo": "9993535005",
              "nthHospital": 5,
              "actualHospitalDays": 7,
              "admissionTime": "2022-07-09 03:02:31",
              "admissionDepartment": "心内二病区",
              "admissionWard": "27",
              "hospitalAdmission": "患者以“反复胸痛、胸闷3年，心悸、气促2天”入院。入院查体：体温36.2℃，脉搏109次/分，呼吸21次/分，血压132/71mmHg。 神志清晰，对答切题。双肺呼吸音粗，双下肺闻及少许湿啰音。心率109次/分，心律齐，各瓣膜听诊区未闻及明显病理性杂音。腹软，无压痛、反跳痛及肌紧张。双下肢无明显水肿。 2021-07-06我院心脏彩超（EF=49%）：1.左房增大，后间隔基底段稍增厚2.左室壁运动异常，考虑陈旧性心肌缺血后改变3.二尖瓣增厚并略显钙化，中度反流4.三尖瓣稍增厚，中重度反流；估测肺动脉收缩压明显增高5.主动脉瓣增厚并轻度钙化，轻度反流6.肺动脉瓣少量反流7.左室收缩功能降低、舒张功能减退8.左室假腱索。。",
              "operationLevel": "3",
              "operationSurgeon": "王国强",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-07-14",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-07-16 02:30:00",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "9",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I25.500,I70.101,I70.900x007,I10.x00x031,E11.900,I48.x02,J98.414,I50.904,Z95.501,I25.200",
              "dischargeOtherDiagnoses": "缺血性心肌病,肾动脉狭窄,外周动脉粥样硬化,高血压病3级（高危）,2型糖尿病,阵发性心房颤动,肺部感染,心功能Ⅲ级,冠状动脉支架植入后状态,陈旧性心肌梗死",
              "dischargeSituation": "患者未诉胸闷、气促、咳嗽、痰少，余无特殊不适。查体：体温 36.4℃，脉搏70次/分，呼吸20次/分，血压114/66mmHg。神志清晰，双肺呼吸音清，双肺未闻及明显啰音。心率70次/分，心律齐，各瓣膜听诊区未闻及明显病理性杂音。腹软，无压痛，双下肢无水肿。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n  2、遵医嘱服药（在医生的指导下调整用药）：    \n     出院带药：阿托伐他汀钙片(优力平) 20mg 口服 1次/晚；硫酸氢氯吡格雷片(波立维) 75mg 口服  1次/日；沙库巴曲缬沙坦钠片(50mg、国谈) 50mg 口服 2次/日；单硝酸异山梨酯片(欣康) 20mg 口服 2次/日；达格列净片 10mg 口服 1次/日；\n      自备药：螺内酯片(安体舒通) 20mg 口服 1次/日；琥珀酸美托洛尔缓释片(倍他乐克) 23.75mg 口服 1次/日；呋塞米片 20mg 口服 1次/日；盐酸二甲双胍缓释片 1g 口服 2次/日；        \n  3、监测血压、血糖、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，根据血糖情况调整降糖药物剂量，自备糖块，防止低血糖，内分泌科随访。\n  4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便等情况请及时来我院门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。心内科门诊随访，如有不适，立即就诊。",
              "hospitalized": "患者入院后完善相关检查： 血气分析：pH值 7.47 ↑,氧分压 78mmHg ↓,钠离子 134mmol/L ↓,钾离子 3.05mmol/L ↓。血常规：白细胞计数 9.8810^9/L ↑,中性粒细胞百分比 79.10% ↑,超敏C反应蛋白（金标法） >5mg/L ↑,C反应蛋白(金标法) 96.82mg/L ↑。B型钠尿肽前体 29047.00pg/mL ↑,降钙素原 0.448ng/ml ↑。心电图：1、窦性心动过速2、提示前侧壁、下壁心肌梗死（请结合临床）3、T波改变。胸片：1.双肺纹理增多，双肺未见实质性病变2.双侧肋膈角稍变浅，双侧少许胸腔积液不除外。心脏彩超（EF=39%）：1.左房增大，左室稍大，后间隔基底段稍增厚2.左室壁运动异常，考虑陈旧性心肌缺血后改变3.二尖瓣增厚并略显钙化，重度反流3.三尖瓣稍增厚，中重度反流；估测肺动脉收缩压明显增高5.主动脉瓣增厚并轻度钙化，轻度反流5.肺动脉瓣轻度反流，估测平均压增高7.左室收缩功能降低、舒张功能减退；右心功能降低8.左室徦腱索。患者入院后于2022-07-14日在局麻下行选择性冠状动脉造影术，显影见前降支原支架内未见明显狭窄，前向血流TIMI 3级，回旋支近段狭窄约50%，原支架未见明显狭窄，支架远端可见瘤样扩张，前向血流TIMI 3级；回旋支远端完全闭塞，可见侧支循环逆灌显影。右冠状动脉原支架内示见明显狭窄，右冠远段狭窄约50%，前向血流TIMI 3级；可见右冠远端与回旋支间较大侧支循环。患者住院期间给予抗血小板、调脂稳定斑块、营养心肌、降压降糖、改善心功能、抗感染、止咳化痰等对症支持治疗，现患者一般情况可，予以今日办理出院。"
            },
            {
              "sickId": "9900019468",
              "name": "何吉科",
              "sex": "男",
              "birthDate": "1958-03-16 16:00:00",
              "age": 62,
              "currentAddress": "重庆市-九龙坡区九龙坡区西彭镇迎新村6组36号",
              "nation": "中国",
              "identityNumber": "999222195803171156",
              "phone": "99908369883",
              "contactName": "何勇",
              "relation": "子",
              "sickNum": "9993906",
              "residenceNo": "9993906002",
              "nthHospital": 2,
              "actualHospitalDays": 6,
              "admissionTime": "2022-09-03 03:09:14",
              "admissionDepartment": "心内三病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“发作性晕厥10余年，劳力性胸闷2年，再发2天。”入院。入院查体：体温36.5℃，脉搏63次/分，呼吸20次/分，血压142/80mmHg。神志清楚，口唇无紫绀，无颈静脉怒张，肝颈回流征阴性。双肺无明显干湿罗音，未闻及哮鸣音。心率63次/分，心律齐，各瓣膜听诊区未闻及杂音。腹软，无压痛、反跳痛及肌紧张，肝脾肋下未及。双下肢无水肿。腱反射对称，病理征阴性。",
              "operationLevel": "4,2,3,3,3,3,3",
              "operationSurgeon": "王国强、黎德才,王国强、黎德才,王国强、黎德才,王国强、黎德才,王国强、黎德才,王国强、黎德才,王国强、黎德才",
              "operationCode": "36.0700,88.4500,88.4103,88.5500,00.4100,00.6600x004,00.4600",
              "operationName": "药物洗脱冠状动脉支架置入,肾动脉造影术,颈动脉造影术,单根导管的冠状动脉造影术,两根血管操作,经皮冠状动脉球囊扩张成形术,置入两根血管的支架",
              "operationDate": "2022-09-05,2022-09-05,2022-09-05,2022-09-05,2022-09-05,2022-09-05,2022-09-05",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "龚忠梅",
              "dischargeTime": "2022-09-09 02:30:00",
              "dischargeDepartment": "心内三病区",
              "dischargeWard": "18",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.000,K29.500,I70.900x007,I42.100,I11.901,I10.x00x027,R42.x00x001,Z95.800x004,I65.001,I50.902,Z95.501",
              "dischargeOtherDiagnoses": "不稳定型心绞痛,慢性胃炎,外周动脉粥样硬化,梗阻性肥厚型心肌病,高血压性心脏病,高血压病2级（高危）,眩晕症,血管支架植入术后状态,椎动脉狭窄,心功能Ⅰ级,冠状动脉支架植入后状态",
              "dischargeSituation": "患者现未诉胸闷不适，头晕明显好转。查体：脉搏62次/分，呼吸20次/分，血压105/70mmHg。神志清楚，查体合作。双肺无明显干湿罗音，未闻及哮鸣音。心率62次/分，心律齐，各瓣膜听诊区未闻及杂音。腹软，无压痛、反跳痛。双下肢无水肿。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n  2、遵医嘱服药（在医生的指导下调整用药）：    \n    出院带药：硫酸氢氯吡格雷片(波立维) 75mg 口服 1次/日；阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次；阿司匹林肠溶片(拜阿司匹灵) 0.1g 口服 1次/日；依折麦布片(益适纯) 10mg 口服 1次/日；琥珀酸美托洛尔缓释片(倍他乐克) 47.5mg 口服 1次/日；\n     自备药：替米沙坦片(美卡素) 40mg 口服 1次/日；        \n  3、监测血压、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，院外出现牙龈出血、皮肤瘀斑、呕血、黑便等情况请及时来我院门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。\n  4、心内科门诊随访，如有不适，立即就诊。",
              "hospitalized": "患者入院后完善相关检查：血脂、肝功：甘油三酯 4.07mmol/L ↑,丙氨酸氨基转移酶 135U/L ↑,天门冬氨酸氨基转移酶 65U/L ↑,γ-谷氨酰转移酶 120U/L ↑。B型钠尿肽前体 303.80ng/L ↑。D-二聚体 0.78mg/L FEU ↑。糖化血红蛋白定量 6.8% ↑。心肌标志物、血常规、感染标志物、甲功、肾功、电解质、二便常规未见明显异常。正常心电图。心脏彩超：1.左房增大，主动脉窦部及升主动脉增宽2.二尖瓣轻中度反流3.三尖瓣、主动脉瓣轻度反流4.左室舒张功能减退5.左冠窦壁粥样硬化斑块形成（硬斑）6.室间隔基底段增厚，二尖瓣瓣尖呈\"SAM\"征，建议经心脏负荷超声检查，排除隐匿性梗阻。胸片：1.左上肺继发性肺结核可能（有纤维钙化灶形成），建议进一步检查；2.主动脉硬化，心影增大。下肢血管彩超：双侧股总动静脉、股深动静脉、股浅动静脉、腘动静脉、大隐静脉可见段彩色多普勒超声未见明显异常。头颅CT：左侧额叶及右侧半卵圆中心、颞叶区散在腔隙性脑梗塞，请结合临床密切随访复查或MRI检查。动态心电图：1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测23小时57分,总心搏数102924，平均心率71次/分，最快心率115次/分，发生在D2 08:36:05；最慢心率53次/分，发生D2 07:02:30) 2、频发多源房性早搏，短阵房性心动过速(全程8658次，房速1阵，个别伴室内差传及未下传) 3、偶发室性早搏(全程2次) 4、ST-T改变：心率增快时见ST段压低0.1-0.2mV，T波低平。动态血压：1．全天血压平均值125/74mmHg；白天血压平均值124/75mmHg；夜间血压平均值127/71mmHg。2．最高收缩压145mmHg，发生在(21:19)；最高舒张压96mmHg，发生在(17:49)。最低收缩压100mmHg，发生在(14:19)；最低舒张压50mmHg，发生在(19:19)。3．血压负荷（指测量的血压值超过正常血压值的次数占总测量次数的百分比）全天收缩压负荷32.6%；全天舒张压负荷32.6%4. 昼夜血压变化规律收缩压呈反杓型改变，舒张压呈非杓型改变。腹部彩超：1.肝饱满，脂肪肝，肝内钙化灶，请结合肝功2.胆囊息肉，随诊3.脾饱满4.双肾超声未见明显异常。负荷超声心动图：左室流出道二尖瓣前叶水平隐匿性梗阻。患者于2022-09-05日在局麻下行选择性冠状动脉造影、"
            },
            {
              "sickId": "9900016601",
              "name": "唐先贵",
              "sex": "男",
              "birthDate": "1960-04-18 16:00:00",
              "age": 61,
              "currentAddress": "重庆市-渝北区重庆市渝北区大湾镇大湾村1组",
              "nation": "中国",
              "identityNumber": "999224196004193831",
              "phone": "99902305153",
              "contactName": "郑宇琼",
              "relation": "配偶",
              "sickNum": "9993329",
              "residenceNo": "9993329004",
              "nthHospital": 4,
              "actualHospitalDays": 4,
              "admissionTime": "2022-08-08 01:19:57",
              "admissionDepartment": "心内二病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“劳力性胸闷、胸痛5年，加重半月。”入院。入院查体：体温36.6℃，脉搏66次/分，呼吸19次/分，血压132/81mmHg。双肺呼吸音清，未闻及干湿啰音，心率66次/分，律齐，各瓣膜听诊区未闻及杂音，肝脾未及，腹软无压痛。双下肢无水肿。腱反射对称，病理征阴性。 （2020-06-11我院）选择性冠状动脉造影术+支架植入术：显影见左主干未见狭窄，前降支中段局限性狭窄约75%，前向血流TIMI 3级。回旋支未见明显狭窄，前向血流TIMI 3级。右冠状动脉近段狭窄约30%，前向血流TIMI 3级，于前降支中段植入1枚支架。\n（2021-04-19我院）下肢血管超声：1.左侧股总动脉后壁粥样硬化斑块（混合斑）2.左侧股浅动脉、股深动脉、腘动脉壁上粥样硬化斑块（硬斑3.右侧股总动脉分叉及股深动脉、股浅动脉、腘动脉壁上粥样硬化斑块（硬斑）。。",
              "operationLevel": "3",
              "operationSurgeon": "赵小松",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-08-10",
              "drugAllergy": "无",
              "doctor": "何云",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-08-12 01:30:00",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "18",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.801,I70.900x007,K29.500,I50.903,Z95.501",
              "dischargeOtherDiagnoses": "稳定型心绞痛,外周动脉粥样硬化,慢性胃炎,心功能Ⅱ级,冠状动脉支架植入后状态",
              "dischargeSituation": "患者未诉胸闷、胸痛等不适。查体：体温：36.6℃，呼吸：20次/分，脉搏：67次/分，血压：119/69mmHg。双肺呼吸音清，未闻及干湿啰音。律齐，各瓣膜区听诊未闻及病理性杂音，穿刺处已结痂，双下肢无水肿。",
              "dischargeInstructions": "1.出院带药：阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次；硫酸氢氯吡格雷片(波立维) 75mg 口服 1次/日；盐酸曲美他嗪片(万爽力) 20mg 口服 3次/日；尼可地尔片(喜格迈) 5mg 口服 3次/日；\n    2、心脏康复建议：1）低盐低脂饮食，避免进食咖啡、浓茶；2）避免受凉、劳累、情绪激动，放松心情，保证充足睡眠，适当进行活动，防跌倒。\n    3、规律用药，禁止随意停药，监测血压、心率（血压低于90/60mmHg、心率低于55次/分及时就诊），注意观察有无低血压、心动过缓、心悸、黑朦、晕厥、胃肠道出血、黑便、皮肤淤点、瘀斑、血尿等，有无出现肌肉疼痛等及时就医。 \n   4、定期复查项目：监测血压、肾功、电解质、心率等，依据监测结果调整用药，3月后复查胸部CT了解肺部病情。 \n   5、术后1月、2月、3月、半年我院复诊，门诊随诊，如有不适，立即就诊。",
              "hospitalized": "入院后积极完善相关辅助检查：心脏超声： 1.主动脉窦部、升主动脉稍增宽，室间隔增厚2.二尖瓣瓣尖稍增厚，瓣下腱索冗长，轻度反流，必要时结合负荷超声检查3.三尖瓣轻度反流4.左室舒张功能减退。腹部超声： 1.肝囊肿，肝内钙化灶2.胆囊壁毛糙3.胰、脾、双肾超声未见明显异常。动态血压：1．全天血压平均值114/70mmHg；白天血压平均值116/71mmHg；夜间血压平均值110/69mmHg。2．最高收缩压125mmHg，发生在(12:14)；最高舒张压79mmHg，发生在(17:39)。最低收缩压103mmHg，发生在(05:29)；最低舒张压62mmHg，发生在(05:29)。3．血压负荷（指测量的血压值超过正常血压值的次数占总测量次数的百分比）全天收缩压负荷2.2%；全天舒张压负荷8.7%昼夜血压变化规律呈非杓型改变。动态心电图：1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测23小时30分,总心搏数93621，平均心率67次/分，最快心率115次/分，发生在D2 08:20:05；最慢心率45次/分，发生D2 03:51:41) 2、偶发多源房性早搏，短阵房性心动过速(全程283次，房速10阵) 3、ST-T未见异常。胸部CT：1.右肺上叶后段磨玻璃结节，Lung-RADS 2级，建议3-6月随访复查； 2.双肺上叶钙化灶； 3.冠状动脉支架植入术后； 4.肝内多发囊肿；肝右叶钙化灶。肝肾功、电解质、凝血功能、血糖、血常规、尿常规、大便常规、血脂、心肌损伤标志物、心衰标志物、甲功、糖化血红蛋白、感染标志物、心电图、肺功能均未见明显异常。予以双联抗血小板聚集、稳定斑块治疗，并于2022-08-10行选择性冠状动脉造影术，显影见：右冠优势型，左主干未见明显狭窄，左前降支近段管壁欠光滑，轻微狭窄，前降支中段原支架内血流通畅，未见明显狭窄及血栓，前向血流TIMI III级；回旋支未见明显狭窄，前向血流TIMI III级。右冠状动脉显影未见明显狭窄，前向血流TIMI III级。术后恢复可。"
            },
            {
              "sickId": "9900001722",
              "name": "杨德碧",
              "sex": "女",
              "birthDate": "2044-08-17 16:00:00",
              "age": 73,
              "currentAddress": "重庆市-北碚区重庆市北碚区施家梁镇桂花村新房子组28号",
              "nation": "中国",
              "identityNumber": "999215194408186325",
              "phone": "99996471065",
              "contactName": "范国银",
              "relation": "子",
              "sickNum": "9990161",
              "residenceNo": "9990161005",
              "nthHospital": 5,
              "actualHospitalDays": 7,
              "admissionTime": "2022-08-09 08:14:08",
              "admissionDepartment": "心内三病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“反复胸闷、心悸9年，胸痛4+年，加重半月。”入院。入院查体：体温36.5℃，脉搏68次/分，呼吸20次/分，血压101/57mmHg。神志清楚，双肺呼吸音清，未闻及干湿啰音，心率68次/分，心律整齐，未闻及病理性杂音，腹软，剑突下有压痛，无反跳痛、肌紧张，双下肢无水肿。 2021.12.20我院心电图：1、窦性心律2、T波改变。腹部彩超：1.脂肪肝2.胆、胰、脾、双肾超声未见明显异常。下肢血管彩超： 1.右侧大隐静脉增宽，大隐静脉瓣功能不良2.双侧腘静脉及双侧小腿肌间静脉管腔内血流瘀滞3.右侧腘动脉内中膜局部毛糙增厚。心脏彩超： 1.左房增大，升主动脉稍增宽，室间隔增厚2.三尖瓣轻度反流3.二尖瓣、主动脉瓣少量反流4.左室舒张功能减退5.房间隔卵圆孔未闭（左向右分流）。 颈部血管彩超：1.右侧锁骨下动脉起始段后壁粥样硬化斑块（混合斑）2.双侧椎动脉走行迂曲。24小时动态心电图：1、窦性心律伴窦性心动过缓(全程监测22小时45分,总心搏数87358次，平均心率64次/分，最快心率82次/分，发生在D1 18:26:45；最慢心率48次/分，发生D2 05:12:02) 2、偶发多源房性早搏，短阵房性心动过速(全程133次，房速3阵) 3、偶发室性早搏(全程2次) 4、房性逸搏 5、T波改变：全程见多导联T波低平、双向、倒置，ST段未见异常。24小时动态血压：1．全天血压平均值148/77mmHg；白天血压平均值144/76mmHg；夜间血压平均值157/78mmHg。2．最高收缩压172mmHg，发生在(22:43)；最高舒张压92mmHg，发生在(17:32)。最低收缩压120mmHg，发生在(13:01)；最低舒张压60mmHg，发生在(08:32)。3．血压负荷（指测量的血压值超过正常血压值的次数占总测量次数的百分比）全天收缩压负荷83.7%；全天舒张压负荷34.9%。4．昼夜血压变化规律呈反杓型改变。 新型冠状病毒核酸检测阴性。冠脉CTA：1.冠状动脉均衡型，冠状动脉中度钙化； 2.左冠状动脉前降支中远段管壁散在钙化斑块形成伴管腔轻微狭窄；回旋支近中段及钝缘支散在钙化斑块形成伴管腔轻度狭窄；右冠状动脉中段散在钙化斑块形成伴管腔轻微狭窄； 3.左冠状动脉前降支中段节段性浅层心肌桥-壁冠状动脉；4.左冠状动脉前降支中段及右冠状动脉近段支架植入术后； 5.左心房增大。CAD-RADS 2 G。",
              "operationLevel": "3",
              "operationSurgeon": "赵小松",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-08-12",
              "drugAllergy": "无",
              "doctor": "何云",
              "responsibleNurse": "龚忠梅",
              "dischargeTime": "2022-08-16 01:00:00",
              "dischargeDepartment": "心内三病区",
              "dischargeWard": "5",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "Z95.501,Q24.501,K76.000,I70.900x007,M81.900,K29.603,I63.900,Q21.101,I11.901,I10.x00x031,I50.903,I20.000",
              "dischargeOtherDiagnoses": "冠状动脉支架植入后状态,心肌桥,脂肪肝,外周动脉粥样硬化,骨质疏松症,糜烂性胃炎,脑梗死,中央型房间隔缺损(卵圆孔型),高血压性心脏病,高血压病3级（高危）,心功能Ⅱ级,不稳定型心绞痛",
              "dischargeSituation": "患者头晕症状好转，血压可，血糖有波动，未诉特殊不适。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率，遵医嘱规律服药（在医生的指导下调整用药，禁止自行停药及增减量）。\n2、出院带药：琥珀酸美托洛尔缓释片(倍他乐克) 47.5mg 口服 1次/日；\n              硫酸氢氯吡格雷片(波立维) 75mg 口服 1次/日；\n              雷贝拉唑钠肠溶片 10mg 口服 1次/日；\n              铝碳酸镁咀嚼片(达喜) 1000mg 嚼服 3次/日；\n              L-谷氨酰胺呱仑酸钠颗粒(麦滋林) 0.67g 口服 2次/日；\n     自备药：  阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次；\n               尼可地尔片(喜格迈) 5mg 口服 3次/日；\n 3、规律监测血压情况，每日至少晨起未服用降压药物前及夜间入睡前测血压，测量前排空膀胱，坐立位并休息至少5分钟，避免交谈或写作，每次测量同一侧上肢的血压（血压高的一侧），间隔1到2分钟测量两次，取平均值，并记录血压、心率值。（90/60mmHg＜血压＜135/85mmHg，心率控制在55-90次/分）\n4、监测体重（每次清晨不穿或只穿少量衣物、空腹、排尿、排便后，使用统一的体重秤测量体重，若三天内，体重增加2kg以上，请及时就诊，评估利尿方案是否调整）。\n5、院外出现牙龈出血、皮肤瘀斑、呕血、黑便、乏力以及血压低于90/60mmHg、心率低于55次/分请及时门诊就诊；随访血常规、肝功、肾功、血脂、凝血、电解质、大便隐血等指标。\n6、3-6个月复查心脏彩超，心内科门诊随访，如有不适，及时就诊。\n    心内科咨询电话：023-65855980。15086928653",
              "hospitalized": "2022.08.09我院心电图：1、窦性心律2、T波改变。尿常规：潜血 1+ *。大便常规+隐血：潜血试验 阳性(+) *。B型钠尿肽前体 167.00ng/L ↑。糖化血红蛋白定量 6.3% ↑。肝肾功、血脂、电解质、心肌标志物、凝血项、D-二聚体、甲功、血栓弹力图、同型半胱氨酸均未见明显异常。心脏彩超：1.左房、右房增大，左室壁基底段增厚2.二尖瓣、三尖瓣轻度反流3.左室舒张功能减退4.卵圆孔未闭（两束，左向右分流）。 颈部血管彩超：1.右侧锁骨下动脉粥样硬化斑块（硬斑）2.左侧锁骨下动脉、双侧颈总动脉、颈内外动脉及椎动脉可见段彩色多普勒超声未见明显异常。下肢血管彩超：1.右侧大隐静脉増宽，大隐静脉瓣功能不良2.双侧大隐静脉、股总静脉、股深浅静脉、肌间静脉血流淤滞。腹部彩超： 1.脂肪肝2.胆、胰、脾、双肾超声未见明显异常. 胸片：1.右膈局限性膨隆，双肺未见明显实质性病变； 2.主动脉硬化； 3.脊柱胸段轻度左侧弯改变。2022.08.12我院复查冠脉造影：提示右冠优势型，左前降支近段原支架通畅，中远段肌桥收缩期狭窄约40%，前向血流TIMI III级，回旋支中远段狭窄约30-40%，前向血流TIMI III级。右冠远段轻微狭窄，后降支开口狭窄约50%，前向血流TIMI III级。给予抗血小板聚集、稳定斑块、营养心肌、抑酸护胃等对症治疗。"
            },
            {
              "sickId": "9900017553",
              "name": "宋世维",
              "sex": "男",
              "birthDate": "1979-09-15 16:00:00",
              "age": 40,
              "currentAddress": "重庆市-江北区江北区海尔路181号兰溪小区46幢4单元6-2",
              "nation": "中国",
              "identityNumber": "999211197909163410",
              "phone": "99983679066",
              "contactName": "王庆碧",
              "contactPhone": "18696618436",
              "relation": "父母",
              "sickNum": "9993513",
              "residenceNo": "9993513003",
              "nthHospital": 3,
              "actualHospitalDays": 7,
              "admissionTime": "2022-07-18 01:26:33",
              "admissionDepartment": "心内二病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“胸痛2年，再发1周。”入院。入院查体：体温36.3℃，脉搏73次/分，呼吸19次/分，血压120/72mmHg。神志清楚，步入病房，言清语晰，查体合作，自动体位。双肺呼吸音清，未闻及干湿啰音。心脏听诊律齐，心率73次/分，各瓣膜听诊区未闻及杂音。全腹无压痛、反跳痛及肌紧张，肠鸣音4次/分，移动性浊音阴性。双下肢无水肿。 2022-05-08我院心脏超声:1.左房增大，室间隔基底段增厚；2.主动脉瓣轻度反流，瓣口收缩期流速稍增快；3.二尖瓣、三尖瓣轻度反流；4.左室下壁及后壁运动减弱，心肌增厚率降低；左室收缩功能正常，舒张功能轻度减退。",
              "operationLevel": "3,3,3",
              "operationSurgeon": "何云,何云,何云",
              "operationCode": "00.6600x008,88.5500,00.4100",
              "operationName": "经皮冠状动脉药物球囊扩张成形术,单根导管的冠状动脉造影术,两根血管操作",
              "operationDate": "2022-07-19,2022-07-19,2022-07-19",
              "drugAllergy": "无",
              "doctor": "王国强",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-07-25 02:20:25",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "20",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.000,E78.500,I70.900x007,I11.901,I10.x00x031,I25.200,I50.902,Z95.501",
              "dischargeOtherDiagnoses": "不稳定型心绞痛,高脂血症,外周动脉粥样硬化,高血压性心脏病,高血压病3级（高危）,陈旧性心肌梗死,心功能Ⅰ级,冠状动脉支架植入后状态",
              "dischargeSituation": "患者神志清楚，未诉心悸、胸闷、胸痛，无气促、黑曚、晕厥等不适。精神、食欲、睡眠尚可，大小便正常。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n2、遵医嘱服药（在医生的指导下调整用药）：    \n  出院带药：\n     利伐沙班片(班瑞吉) 10mg 口服 1次/日\n     硫酸氢氯吡格雷片(泰嘉) 75mg 口服 1次/日\n     瑞舒伐他汀钙片(可定) 10mg 口服 每晚一次\n     琥珀酸美托洛尔缓释片(倍他乐克) 71.25mg 口服 1次/日\n     厄贝沙坦片(安来) 0.15g 口服 1次/日\n  \n    自备药：盐酸曲美他嗪片(万爽力) 20mg 口服 3次/日\n      \n3、监测血压、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，院外出现牙龈出血、皮肤瘀斑、呕血、黑便等情况请及时来我院门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。\n4、心内科门诊随访，如有不适，立即就诊。心内二科医生办公室电话：65855878。",
              "hospitalized": "此次入院查心电图:1、窦性心律；2、提示陈旧性下壁心肌梗死；3、ST-T改变。动态心电图:1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测22小时18分,总心搏数94697，平均心率71次/分，最快心率109次/分，发生在D2 09:19:21；最慢心率49次/分，发生D2 04:27:55) 2、偶发多源房性早搏(全程9次) 3、偶发室性早搏(全程3次) 4、常规同步12导联心电图有下壁及后壁心肌梗死，请结合常规心电图及临床 5、ST-T改变：全程见多导联ST压低超过0.1-0.2mV，伴T波低平、双向、倒置。动态血压:1．全天血压平均值109/70mmHg；白天血压平均值111/71mmHg；夜间血压平均值104/67mmHg。2．最高收缩压130mmHg，发生在(09:23)；最高舒张压89mmHg，发生在(05:07)。最低收缩压95mmHg，发生在(22:26)；最低舒张压51mmHg，发生在(23:46)。3．血压负荷（指测量的血压值超过正常血压值的次数占总测量次数的百分比）。全天收缩压负荷0.0%；全天舒张压负荷3.9%。4．昼夜血压变化规律呈非杓型改变。肌钙蛋白T 59.72pg/ml ↑，甘油三酯 3.28mmol/L ↑，糖化血红蛋白定量 6.4% ↑，肝功、肾功、电解质、凝血象未见明显异常。心脏超声:1.左房增大，室间隔基底段增厚；2.主动脉瓣瓣缘稍增厚，回声稍增强，轻度反流；3.二尖瓣、三尖瓣轻度反流；4.左室前壁、下壁及后壁心尖段运动减弱，心肌增厚率降低；左室收缩功能正常，舒张功能轻度减退。 颈部血管超声:1.右侧锁骨下动脉起始段后壁粥样硬化斑块（软斑）；2.左侧颈总动脉粥样硬化斑块（软斑）；3.双侧颈总动脉及颈动脉窦部内中膜毛糙稍增厚。下肢血管超声:双侧股总动静脉、股深动静脉、股浅动静脉、腘动静脉、大隐静脉可见段彩色多普勒超声未见明显异常。入院后予以抗血小板聚集、稳定斑块、对症等治疗，并于07-19行冠状动脉造影术+冠状动脉腔内成形术，显影见前降支原支架内未见明显狭窄，前向血流TIMI 3级；回旋支原支架通畅，前向血流TIMI 3级；钝缘支原支架内次全闭塞，前向血流TIMI 1级。右冠状动脉显影原支架内完全闭塞，前向血流TIMI 0级。将6F JL3.5 Guiding管送至左冠脉窦，调整Guiding管至左冠状动脉口，沿Guiding管送入sion导丝至回旋支远端，送入另一"
            },
            {
              "sickId": "9900014124",
              "name": "李洪兵",
              "sex": "男",
              "birthDate": "1975-02-26 16:00:00",
              "age": 44,
              "currentAddress": "重庆市-沙坪坝区重庆市沙坪坝区松堡40号1-4",
              "nation": "中国",
              "identityNumber": "999222197502275516",
              "phone": "99940576372",
              "contactName": "刘书萍",
              "relation": "配偶",
              "sickNum": "9992698",
              "residenceNo": "9992698002",
              "nthHospital": 2,
              "actualHospitalDays": 3,
              "admissionTime": "2022-08-31 03:00:17",
              "admissionDepartment": "心内二病区",
              "admissionWard": "32",
              "hospitalAdmission": "患者以“反复劳力性心前区疼痛3年余，加重1天。”入院。入院查体：体温36.5℃，脉搏75次/分，呼吸19次/分，血压126/85mmHg。颈软，颈静脉无怒张，肝颈静脉回流征阴性，颈动脉搏动正常 ，气管居中，甲状腺无肿大，无血管杂音。胸廓正常，双肺呼吸音清，未闻及干湿啰音。心前区无异常隆起，心尖搏动正常，心界正常。心率75 次/分，心律齐，各瓣膜听诊区未闻及病理性杂音。周围血管征阴性。腹部外形正常。腹部触诊全腹软，无压痛 ，无反跳痛 ，未触及肿块，肝肋下未触及，脾肋下未触及，双肾区无叩击痛。腹部无移动性浊音。肠鸣音 正常。 3年前冠脉造影示：前降支与回旋支双开口，前降支近中段狭窄约90%，前向血流TIMI 3级；回旋支走行自然，管壁光滑，未见明显狭窄，前向血流TIMI 3级；右冠状动脉显影未见明显狭窄，前向血流TIMI 3级。 彩超（肝胆胰脾双肾、门静脉）：1.脂肪肝，肝囊肿2.胆、胰、脾、双肾超声未见明显异常；颈部血管彩超：右侧锁骨下动脉起始段后壁粥样硬化斑块（混合斑）；超声心动图+心功能：测值（左房前后径36左室前后径50右房横径39右室横径39右室流出道25主动脉瓣环21主动脉窦部37升主动脉34降主动脉22肺动脉主干25左肺动脉16右肺动脉15左冠状动脉3.9右冠状动脉3.2前间隔基底段14.3、中间段13.4搏幅8.5后间隔基底段14.6左室下侧壁11.7搏幅11左心收缩功能测定：EF＝66％）。提示：1.左房形态饱满，主动脉窦部稍増宽2.左室壁增厚，以室间隔基底段明显3.左室舒张功能减退4.卵圆孔闭合不良，左向右分流5.左室假腱索；胸部螺旋CT平扫：1.双肺上叶尖段局限性肺气肿；2.左肺下叶少许纤维灶；3.左冠状动脉前降支支架植入术后；4.右侧第6、7、8肋骨腋段骨折；5.肝内囊肿及小钙化灶。DR胸部正侧位：双肺未见明显实质性病变。2022-09-0115:48:08常规心电图：1、窦性心律2、提示左房、左室肥大（请结合心脏超声）3、ST-T改变。2022-08-3115:58:28常规心电图：1、窦性心律2、提示左房、左室肥大（请结合心脏超声）3、ST-T改变。2022-09-01动态心电图：1、窦性心律伴窦性心动过缓及窦性心动过速(全程监测22小时59分钟,总心搏数95986，平均心率69次/分，最快心率105次/分，发生在D210:18:48；最慢心率45次/分，发生D208:14:48)2、偶发",
              "operationLevel": "3",
              "operationSurgeon": "赵小松",
              "operationCode": "88.5500",
              "operationName": "单根导管的冠状动脉造影术",
              "operationDate": "2022-09-01",
              "drugAllergy": "无",
              "doctor": "黎德才",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-09-03 07:10:00",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "14",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.900,S22.300,I11.901,I10.x00x031",
              "dischargeOtherDiagnoses": "心绞痛,肋骨骨折,高血压性心脏病,高血压病3级（高危）",
              "dischargeSituation": "患者一般情况可，无胸闷、胸痛不适，精神、食欲、睡眠尚可，大小便正常。查体：心率72次/分，血压134/72mmHg，双肺呼吸音清，双肺未闻及明显干湿啰音。心律齐，各瓣膜区听诊未闻及明显病理性杂音。腹软，无压痛。双下肢无水肿。右侧桡动脉穿刺处敷料清洁干燥，无渗血渗液。",
              "dischargeInstructions": "1.出院带药：\n 琥珀酸美托洛尔缓释片(倍他乐克) 47.5mg 口服 1次/日；硫酸氢氯吡格雷片(波立维) 75mg 口服 1次/日；氯沙坦钾片 50mg 口服 1次/日；阿托伐他汀钙片(立普妥) 20mg 口服 每晚一次；\n 2.低盐低脂饮食，避免进食高胆固醇食物，避免进食咖啡、浓茶，戒烟戒酒，避免受凉、劳累、情绪激动，放松心情，保证充足睡眠，适当进行活动。\n 3.规律监测血压、心率，观察药物不良反应：出血倾向，注意有无皮下淤斑、淤点、胃肠道出血、黑便、血尿等，有无出现肌肉疼痛。 \n 4.定期复查项目：血常规、肝功、血脂、肾功、凝血项、电解质、血糖，心电图等。\n 5.门诊随诊，如有不适，立即就诊。",
              "hospitalized": "入院后完善相关检查，积极控制血压、降脂、抗凝等治疗，并于2022-09-01 冠状动脉造影:左冠优势型，前降支与回旋支双开口，前降支支架近端轻度狭窄约20-30%，原支架内通畅，前向血流TIMI 3级；回旋支中段发出第一钝缘支后局限性狭窄30-40%，前向血流TIMI 3级;右冠状动脉显影未见明显狭窄，前向血流TIMI 3级。术后继续控制血压、降脂、抗凝等治疗。"
            },
            {
              "sickId": "9900000091",
              "name": "潘钟友",
              "sex": "男",
              "birthDate": "1964-08-06 16:00:00",
              "age": 54,
              "currentAddress": "重庆市-开州区重庆市开州区义和镇相辞村1组107号",
              "nation": "中国",
              "identityNumber": "999222196408075814",
              "phone": "99926189049",
              "contactName": "郑持香",
              "relation": "其他",
              "sickNum": "9990012",
              "residenceNo": "9990012006",
              "nthHospital": 6,
              "actualHospitalDays": 2,
              "admissionTime": "2022-09-17 02:23:03",
              "admissionDepartment": "心内三病区",
              "admissionWard": "38",
              "drugAllergy": "无",
              "doctor": "谢先宇",
              "responsibleNurse": "娄为清",
              "dischargeTime": "2022-09-19 06:00:00",
              "dischargeDepartment": "心外一科",
              "dischargeWard": "32",
              "dischargeDiseaseCode": "T82.000x001",
              "dischargeMainDiagnosis": "心脏瓣膜置换术后瓣膜故障",
              "otherDiseaseCodes": "Z95.200x002,I07.100,K26.900x001,I50.905,Z95.501,I25.200,I25.103,I50.904,I27.201,I48.x00x007,Z95.200x003",
              "dischargeOtherDiagnoses": "二尖瓣机械瓣置换状态,三尖瓣关闭不全,十二指肠溃疡,心功能Ⅳ级,冠状动脉支架植入后状态,陈旧性心肌梗死,冠状动脉粥样硬化性心脏病,心功能Ⅲ级,继发性肺动脉高压,持续性心房颤动,主动脉瓣机械瓣置换状态"
            },
            {
              "sickId": "9900007860",
              "name": "夏太富",
              "sex": "男",
              "birthDate": "1950-10-05 16:00:00",
              "age": 68,
              "currentAddress": "重庆市-沙坪坝区重庆市沙坪坝区华宇广场1号22-15",
              "nation": "中国",
              "identityNumber": "999212195010062117",
              "phone": "99908311466",
              "contactName": "谭红",
              "relation": "配偶",
              "sickNum": "9991243",
              "residenceNo": "9991243006",
              "nthHospital": 6,
              "actualHospitalDays": 5,
              "admissionTime": "2022-07-22 02:10:57",
              "admissionDepartment": "心内二病区",
              "admissionWard": "44",
              "hospitalAdmission": "患者以“胸痛、胸闷3年余，再发两周伴四肢红斑丘疹5天”入院。入院查体：体温36.3℃，脉搏75次/分，呼吸19次/分，血压130/65mmHg。 神清合作，躯干、四肢可见大小不一红斑及散在皮疹。双肺呼吸音清，双肺无明显干湿啰音，心率75次/分，律齐，各瓣膜听诊区未闻及病理性杂音，腹软无压痛，双下肢无水肿。 2022-07-08日我院普通心电图：1、窦性心律 2、提示左房肥大3、完全性右束支阻滞 4、提示陈旧性前间壁心肌梗死。心脏彩超：1.左房增大，左室稍大，升主动脉稍增宽，室间隔增厚2.左室舒张功能减退3.左室壁节段性运动异常4.主动脉窦管连接部粥样硬化斑块（硬斑）。",
              "drugAllergy": "有",
              "doctor": "王国强",
              "responsibleNurse": "林娟",
              "dischargeTime": "2022-07-27 04:15:00",
              "dischargeDepartment": "心内二病区",
              "dischargeWard": "8",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I20.000,Z95.800x003,I70.101,I70.900x007,J42.x00,E11.900,I10.x00x027,Z95.800x003,I77.126,Z95.800x004,I71.004,L23.901,I50.903,Z95.501,I25.204",
              "dischargeOtherDiagnoses": "不稳定型心绞痛,周围血管支架植入术后状态,肾动脉狭窄,外周动脉粥样硬化,慢性支气管炎,2型糖尿病,高血压病2级（高危）,周围血管支架植入术后状态,髂外动脉狭窄,血管支架植入术后状态,腹主动脉夹层,过敏性皮炎,心功能Ⅱ级,冠状动脉支架植入后状态,陈旧性前间壁心肌梗死",
              "dischargeSituation": "患者四肢红斑丘疹明显好转，无胸闷、胸痛等。查体：脉搏67次/分，呼吸19次/分，血压114/65mmHg。神清合作，躯干、四肢皮疹明显消退。心律齐，各瓣膜听诊区未闻及病理性杂音，肺、腹查体阴性，双下肢无水肿。",
              "dischargeInstructions": "1、心脏康复建议：注意休息，适当活动，防跌倒，避免受凉、劳累、熬夜和情绪激动，保持心情愉悦、充足睡眠，禁烟、酒，避免吸入二手烟，保持大小便通畅，低盐低脂饮食，避免进食高胆固醇食物，避免暴饮暴食，避免进食咖啡、浓茶、运动功能性饮料，监测血压、心率。\n2、遵医嘱服药（在医生的指导下调整用药）：氯雷他定片10mg 口服 1次/日；阿司匹林肠溶片 0.1g 口服 1次/日；琥珀酸美托洛尔缓释片 47.5mg 口服 1次/日；阿托伐他汀钙片 20mg 口服 1次/晚；盐酸曲美他嗪片 20mg 口服 3次/日；厄贝沙坦片 0.15g 口服 1次/日；单硝酸异山梨酯缓释胶囊( Ⅳ) 50mg 口服 1次/晚；阿卡波糖片 100mg 口服 3次/日；达格列净片 10mg 口服 1次/日；    \n3、监测血压、血糖、心率，血压低于90/60mmHg、心率低于55次/分请及时门诊就诊，根据血糖情况调整降糖药物剂量，自备糖块，防止低血糖，内分泌科随访。\n4、院外出现牙龈出血、皮肤瘀斑、呕血、黑便等情况请及时来我院门诊就诊，随访电解质、肝肾功、甲功、凝血象、血脂等指标，随访心电图等检查。\n5、我科、皮肤科门诊随访，如有不适，立即就诊。心内二病区医生办公室电话：65855878。",
              "hospitalized": "患者入院后完善相关检查：血常规：中性粒细胞百分比 76.20% ↑。肝肾功、电解质未见明显异常。尿常规：葡萄糖 3+。患者入院后予以抗血小板、调脂、改善心肌缺血、降压降糖、抗过敏及对症治疗，现患者一般情况可，皮疹明显消退，予以今日办理出院。"
            },
            {
              "sickId": "9900011719",
              "name": "陈小平",
              "sex": "女",
              "birthDate": "1953-04-18 16:00:00",
              "age": 67,
              "currentAddress": "重庆市-巴南区巴南区李家沱街道融汇大道2号17幢2-2",
              "nation": "中国",
              "identityNumber": "99900219530419004X",
              "phone": "99908380646",
              "contactName": "陈勇",
              "relation": "子",
              "sickNum": "9992138",
              "residenceNo": "9992138004",
              "nthHospital": 4,
              "actualHospitalDays": 15,
              "admissionTime": "2022-07-20 06:24:02",
              "admissionDepartment": "心外一科",
              "admissionWard": "33",
              "drugAllergy": "无",
              "doctor": "韦洋",
              "responsibleNurse": "娄为清",
              "dischargeTime": "2022-08-04 00:00:00",
              "dischargeDepartment": "心外一科",
              "dischargeWard": "18",
              "dischargeDiseaseCode": "I25.103",
              "dischargeMainDiagnosis": "冠状动脉粥样硬化性心脏病",
              "otherDiseaseCodes": "I25.200,K76.000,I70.900x007,I49.300x001,I50.903,I27.201,I07.100,I34.001,I35.100,Z95.501",
              "dischargeOtherDiagnoses": "陈旧性心肌梗死,脂肪肝,外周动脉粥样硬化,频发性室性期前收缩,心功能Ⅱ级,继发性肺动脉高压,三尖瓣关闭不全,二尖瓣反流,主动脉瓣关闭不全,冠状动脉支架植入后状态"
            }
          ]
        }';

        $resp = json_decode($simulated);
        $records = array_slice($resp->result, ($pageNum - 1) * $pageSize, $pageSize);
        foreach ($records as $r) {
            $r->total = count($records);
        }
        return $records;
    }
}